Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x553 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x86d05): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x467db): ../Core/BlinkTask/BlinkTask.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x7bd3a): F:/WorkSpace/stmDemoApp/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x43ac5): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x1b3be): unsigned char
 <1><38>: Abbrev Number: 5 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x64f0a): short int

    <78>   DW_AT_name        : (indirect string, offset: 0xb844): unsigned int
 <1><7c>: Abbrev Number: 2 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0x8b500): uint32_t
    <81>   DW_AT_decl_file   : 3
    <82>   DW_AT_decl_line   : 48
    <83>   DW_AT_decl_column : 20
    <84>   DW_AT_type        : <0x4d>
 <1><88>: Abbrev Number: 2 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x88075): size_t
    <8d>   DW_AT_decl_file   : 4
    <8e>   DW_AT_decl_line   : 214
    <8f>   DW_AT_decl_column : 23
    <90>   DW_AT_type        : <0x75>
 <1><94>: Abbrev Number: 5 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 4	(float)
    <97>   DW_AT_name        : (indirect string, offset: 0xcf6f): long double
 <1><9b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <9c>   DW_AT_byte_size   : 4
 <1><9d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9e>   DW_AT_encoding    : 5	(signed)
    <9f>   DW_AT_byte_size   : 4
    <a0>   DW_AT_type        : <0x6e>
    <a4>   DW_AT_decl_file   : 5
    <a5>   DW_AT_decl_line   : 176
    <a6>   DW_AT_decl_column : 14
    <a7>   DW_AT_sibling     : <0xdf>
 <2><ab>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ac>   DW_AT_name        : (indirect string, offset: 0x77768): osOK
    <b0>   DW_AT_const_value : 0
 <2><b1>: Abbrev Number: 7 (DW_TAG_enumerator)
    <b2>   DW_AT_name        : (indirect string, offset: 0x8a174): osError
    <b6>   DW_AT_const_value : -1
 <2><b7>: Abbrev Number: 7 (DW_TAG_enumerator)
    <b8>   DW_AT_name        : (indirect string, offset: 0x88872): osErrorTimeout
    <bc>   DW_AT_const_value : -2
 <2><bd>: Abbrev Number: 7 (DW_TAG_enumerator)
    <be>   DW_AT_name        : (indirect string, offset: 0x5847a): osErrorResource
    <c2>   DW_AT_const_value : -3
 <2><c3>: Abbrev Number: 7 (DW_TAG_enumerator)
    <c4>   DW_AT_name        : (indirect string, offset: 0x22f6b): osErrorParameter
    <c8>   DW_AT_const_value : -4
 <2><c9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ca>   DW_AT_name        : (indirect string, offset: 0x17575): osErrorNoMemory
    <ce>   DW_AT_const_value : -5
 <2><cf>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d0>   DW_AT_name        : (indirect string, offset: 0x2445c): osErrorISR
    <d4>   DW_AT_const_value : -6
 <2><d5>: Abbrev Number: 19 (DW_TAG_enumerator)
    <d6>   DW_AT_name        : (indirect string, offset: 0x440ae): osStatusReserved
    <da>   DW_AT_const_value : 0x7fffffff
 <2><de>: Abbrev Number: 0
 <1><df>: Abbrev Number: 2 (DW_TAG_typedef)
    <e0>   DW_AT_name        : (indirect string, offset: 0x2e0b6): osStatus_t
    <e4>   DW_AT_decl_file   : 5
    <e5>   DW_AT_decl_line   : 185
    <e6>   DW_AT_decl_column : 3
    <e7>   DW_AT_type        : <0x9d>
 <1><eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x892f6): osMutexId_t
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 198
    <f2>   DW_AT_decl_column : 15
    <f3>   DW_AT_type        : <0x9b>
 <1><f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x8b877): osSemaphoreId_t
    <fc>   DW_AT_decl_file   : 5
    <fd>   DW_AT_decl_line   : 201
    <fe>   DW_AT_decl_column : 15
    <ff>   DW_AT_type        : <0x9b>
 <1><103>: Abbrev Number: 2 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0x3d5e1): osMessageQueueId_t
    <108>   DW_AT_decl_file   : 5
    <109>   DW_AT_decl_line   : 207
    <10a>   DW_AT_decl_column : 15
    <10b>   DW_AT_type        : <0x9b>
 <1><10f>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <110>   DW_AT_byte_size   : 4
    <110>   DW_AT_type        : <0x11b>
 <1><114>: Abbrev Number: 5 (DW_TAG_base_type)
    <115>   DW_AT_byte_size   : 1
    <116>   DW_AT_encoding    : 8	(unsigned char)
    <117>   DW_AT_name        : (indirect string, offset: 0x89731): char
 <1><11b>: Abbrev Number: 12 (DW_TAG_const_type)
    <11c>   DW_AT_type        : <0x114>
 <1><120>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <121>   DW_AT_byte_size   : 4
    <121>   DW_AT_type        : <0x114>
 <1><125>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <126>   DW_AT_byte_size   : 4
    <126>   DW_AT_type        : <0x12a>
 <1><12a>: Abbrev Number: 20 (DW_TAG_const_type)
 <1><12b>: Abbrev Number: 2 (DW_TAG_typedef)
    <12c>   DW_AT_name        : (indirect string, offset: 0x43a6b): int8
    <130>   DW_AT_decl_file   : 6
    <131>   DW_AT_decl_line   : 23
    <132>   DW_AT_decl_column : 33
    <133>   DW_AT_type        : <0x114>
 <1><137>: Abbrev Number: 12 (DW_TAG_const_type)
    <138>   DW_AT_type        : <0x12b>
 <1><13c>: Abbrev Number: 2 (DW_TAG_typedef)
    <13d>   DW_AT_name        : (indirect string, offset: 0x43a6a): uint8
    <141>   DW_AT_decl_file   : 6
    <142>   DW_AT_decl_line   : 24
    <143>   DW_AT_decl_column : 33
    <144>   DW_AT_type        : <0x31>
 <1><148>: Abbrev Number: 2 (DW_TAG_typedef)
    <149>   DW_AT_name        : (indirect string, offset: 0x7e1bf): uint16
    <14d>   DW_AT_decl_file   : 6
    <14e>   DW_AT_decl_line   : 26
    <14f>   DW_AT_decl_column : 33
    <150>   DW_AT_type        : <0x3f>
 <1><154>: Abbrev Number: 2 (DW_TAG_typedef)
    <155>   DW_AT_name        : (indirect string, offset: 0x7e986): uint32
    <159>   DW_AT_decl_file   : 6
    <15a>   DW_AT_decl_line   : 28
    <15b>   DW_AT_decl_column : 33
    <15c>   DW_AT_type        : <0x75>
 <1><160>: Abbrev Number: 13 (DW_TAG_structure_type)
    <161>   DW_AT_name        : (indirect string, offset: 0x6f5fc): _TASKPARAM_
    <165>   DW_AT_byte_size   : 16
    <166>   DW_AT_decl_file   : 7
    <166>   DW_AT_decl_line   : 25
    <167>   DW_AT_decl_column : 16
    <167>   DW_AT_sibling     : <0x19c>
 <2><16b>: Abbrev Number: 4 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0x69a4a): psemSWSemaphoreID
    <170>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 27
    <171>   DW_AT_decl_column : 18
    <172>   DW_AT_type        : <0xf7>
    <176>   DW_AT_data_member_location: 0
 <2><177>: Abbrev Number: 4 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x80f1e): psemMSSemaphoreID
    <17c>   DW_AT_decl_file   : 7
    <17c>   DW_AT_decl_line   : 28
    <17d>   DW_AT_decl_column : 18
    <17e>   DW_AT_type        : <0xf7>
    <182>   DW_AT_data_member_location: 4
 <2><183>: Abbrev Number: 4 (DW_TAG_member)
    <184>   DW_AT_name        : (indirect string, offset: 0x8a2d): pmutMutexID
    <188>   DW_AT_decl_file   : 7
    <188>   DW_AT_decl_line   : 29
    <189>   DW_AT_decl_column : 14
    <18a>   DW_AT_type        : <0xeb>
    <18e>   DW_AT_data_member_location: 8
 <2><18f>: Abbrev Number: 4 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x7a445): pmqMQueueID
    <194>   DW_AT_decl_file   : 7
    <194>   DW_AT_decl_line   : 30
    <195>   DW_AT_decl_column : 21
    <196>   DW_AT_type        : <0x103>
    <19a>   DW_AT_data_member_location: 12
 <2><19b>: Abbrev Number: 0
 <1><19c>: Abbrev Number: 2 (DW_TAG_typedef)
    <19d>   DW_AT_name        : (indirect string, offset: 0x360e4): TASKPARAM
    <1a1>   DW_AT_decl_file   : 7
    <1a2>   DW_AT_decl_line   : 31
    <1a3>   DW_AT_decl_column : 2
    <1a4>   DW_AT_type        : <0x160>
 <1><1a8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x790b6): _MESSAGE_
    <1ad>   DW_AT_byte_size   : 64
    <1ae>   DW_AT_decl_file   : 7
    <1ae>   DW_AT_decl_line   : 33
    <1af>   DW_AT_decl_column : 16
    <1af>   DW_AT_sibling     : <0x1e4>
 <2><1b3>: Abbrev Number: 4 (DW_TAG_member)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x1cd8c): ucUUID
    <1b8>   DW_AT_decl_file   : 7
    <1b8>   DW_AT_decl_line   : 35
    <1b9>   DW_AT_decl_column : 7
    <1ba>   DW_AT_type        : <0x1e4>
    <1be>   DW_AT_data_member_location: 0
 <2><1bf>: Abbrev Number: 4 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xce75): ucCommand
    <1c4>   DW_AT_decl_file   : 7
    <1c4>   DW_AT_decl_line   : 36
    <1c5>   DW_AT_decl_column : 8
    <1c6>   DW_AT_type        : <0x13c>
    <1ca>   DW_AT_data_member_location: 5
 <2><1cb>: Abbrev Number: 4 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x6ff4e): ucData
    <1d0>   DW_AT_decl_file   : 7
    <1d0>   DW_AT_decl_line   : 37
    <1d1>   DW_AT_decl_column : 7
    <1d2>   DW_AT_type        : <0x1e4>
    <1d6>   DW_AT_data_member_location: 6
 <2><1d7>: Abbrev Number: 4 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x51de7): RESERVED
    <1dc>   DW_AT_decl_file   : 7
    <1dc>   DW_AT_decl_line   : 38
    <1dd>   DW_AT_decl_column : 8
    <1de>   DW_AT_type        : <0x1f4>
    <1e2>   DW_AT_data_member_location: 11
 <2><1e3>: Abbrev Number: 0
 <1><1e4>: Abbrev Number: 9 (DW_TAG_array_type)
    <1e5>   DW_AT_type        : <0x12b>
    <1e9>   DW_AT_sibling     : <0x1f4>
 <2><1ed>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1ee>   DW_AT_type        : <0x75>
    <1f2>   DW_AT_upper_bound : 4
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 9 (DW_TAG_array_type)
    <1f5>   DW_AT_type        : <0x13c>
    <1f9>   DW_AT_sibling     : <0x204>
 <2><1fd>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1fe>   DW_AT_type        : <0x75>
    <202>   DW_AT_upper_bound : 52
 <2><203>: Abbrev Number: 0
 <1><204>: Abbrev Number: 2 (DW_TAG_typedef)
    <205>   DW_AT_name        : (indirect string, offset: 0x79f76): MESSAGE
    <209>   DW_AT_decl_file   : 7
    <20a>   DW_AT_decl_line   : 39
    <20b>   DW_AT_decl_column : 2
    <20c>   DW_AT_type        : <0x1a8>
 <1><210>: Abbrev Number: 13 (DW_TAG_structure_type)
    <211>   DW_AT_name        : (indirect string, offset: 0x2981a): _ACKNOWLEDGE_
    <215>   DW_AT_byte_size   : 64
    <216>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 41
    <217>   DW_AT_decl_column : 16
    <217>   DW_AT_sibling     : <0x258>
 <2><21b>: Abbrev Number: 4 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x1cd8c): ucUUID
    <220>   DW_AT_decl_file   : 7
    <220>   DW_AT_decl_line   : 43
    <221>   DW_AT_decl_column : 7
    <222>   DW_AT_type        : <0x1e4>
    <226>   DW_AT_data_member_location: 0
 <2><227>: Abbrev Number: 4 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0xce75): ucCommand
    <22c>   DW_AT_decl_file   : 7
    <22c>   DW_AT_decl_line   : 44
    <22d>   DW_AT_decl_column : 8
    <22e>   DW_AT_type        : <0x13c>
    <232>   DW_AT_data_member_location: 5
 <2><233>: Abbrev Number: 4 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x6ff4e): ucData
    <238>   DW_AT_decl_file   : 7
    <238>   DW_AT_decl_line   : 45
    <239>   DW_AT_decl_column : 7
    <23a>   DW_AT_type        : <0x1e4>
    <23e>   DW_AT_data_member_location: 6
 <2><23f>: Abbrev Number: 4 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x2b4c3): ucState
    <244>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 46
    <245>   DW_AT_decl_column : 8
    <246>   DW_AT_type        : <0x13c>
    <24a>   DW_AT_data_member_location: 11
 <2><24b>: Abbrev Number: 4 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x51de7): RESERVED
    <250>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 47
    <251>   DW_AT_decl_column : 8
    <252>   DW_AT_type        : <0x258>
    <256>   DW_AT_data_member_location: 12
 <2><257>: Abbrev Number: 0
 <1><258>: Abbrev Number: 9 (DW_TAG_array_type)
    <259>   DW_AT_type        : <0x13c>
    <25d>   DW_AT_sibling     : <0x268>
 <2><261>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <262>   DW_AT_type        : <0x75>
    <266>   DW_AT_upper_bound : 51
 <2><267>: Abbrev Number: 0
 <1><268>: Abbrev Number: 2 (DW_TAG_typedef)
    <269>   DW_AT_name        : (indirect string, offset: 0x6f449): ACKNOWLEDGE
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 48
    <26f>   DW_AT_decl_column : 2
    <270>   DW_AT_type        : <0x210>
 <1><274>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <275>   DW_AT_name        : (indirect string, offset: 0x28e22): _ERRORVALUE_
    <279>   DW_AT_encoding    : 7	(unsigned)
    <27a>   DW_AT_byte_size   : 1
    <27b>   DW_AT_type        : <0x31>
    <27f>   DW_AT_decl_file   : 7
    <280>   DW_AT_decl_line   : 50
    <281>   DW_AT_decl_column : 14
    <282>   DW_AT_sibling     : <0x2bd>
 <2><286>: Abbrev Number: 6 (DW_TAG_enumerator)
    <287>   DW_AT_name        : (indirect string, offset: 0x46f06): ERR_OK
    <28b>   DW_AT_const_value : 0
 <2><28c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <28d>   DW_AT_name        : (indirect string, offset: 0x398ca): ERR_Q_FULL
    <291>   DW_AT_const_value : 1
 <2><292>: Abbrev Number: 6 (DW_TAG_enumerator)
    <293>   DW_AT_name        : (indirect string, offset: 0x54f01): ERR_Q_EMPTY
    <297>   DW_AT_const_value : 2
 <2><298>: Abbrev Number: 6 (DW_TAG_enumerator)
    <299>   DW_AT_name        : (indirect string, offset: 0x8322): ERR_Q_SEND_FAILED
    <29d>   DW_AT_const_value : 3
 <2><29e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <29f>   DW_AT_name        : (indirect string, offset: 0x58d33): ERR_Q_REC_FAILED
    <2a3>   DW_AT_const_value : 4
 <2><2a4>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x6ec99): ERR_MSG_OK
    <2a9>   DW_AT_const_value : 5
 <2><2aa>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x71dbb): ERR_MSG_WRONG_CMND
    <2af>   DW_AT_const_value : 6
 <2><2b0>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x6844c): ERR_ACK_OK
    <2b5>   DW_AT_const_value : 7
 <2><2b6>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x33191): ERR_ACK_ERR
    <2bb>   DW_AT_const_value : 8
 <2><2bc>: Abbrev Number: 0
 <1><2bd>: Abbrev Number: 2 (DW_TAG_typedef)
    <2be>   DW_AT_name        : (indirect string, offset: 0x120ab): ERRORVALUE
    <2c2>   DW_AT_decl_file   : 7
    <2c3>   DW_AT_decl_line   : 61
    <2c4>   DW_AT_decl_column : 2
    <2c5>   DW_AT_type        : <0x274>
 <1><2c9>: Abbrev Number: 9 (DW_TAG_array_type)
    <2ca>   DW_AT_type        : <0x12b>
    <2ce>   DW_AT_sibling     : <0x2d9>
 <2><2d2>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <2d3>   DW_AT_type        : <0x75>
    <2d7>   DW_AT_upper_bound : 63
 <2><2d8>: Abbrev Number: 0
 <1><2d9>: Abbrev Number: 22 (DW_TAG_variable)
    <2da>   DW_AT_name        : (indirect string, offset: 0x3ea69): pcBlinkTaskLog
    <2de>   DW_AT_decl_file   : 1
    <2df>   DW_AT_decl_line   : 22
    <2e0>   DW_AT_decl_column : 6
    <2e1>   DW_AT_type        : <0x2c9>
    <2e5>   DW_AT_external    : 1
    <2e5>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><2eb>: Abbrev Number: 23 (DW_TAG_subprogram)
    <2ec>   DW_AT_external    : 1
    <2ec>   DW_AT_name        : (indirect string, offset: 0x6f3df): osDelay
    <2f0>   DW_AT_decl_file   : 5
    <2f1>   DW_AT_decl_line   : 459
    <2f3>   DW_AT_decl_column : 12
    <2f4>   DW_AT_prototyped  : 1
    <2f4>   DW_AT_type        : <0xdf>
    <2f8>   DW_AT_declaration : 1
    <2f8>   DW_AT_sibling     : <0x302>
 <2><2fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <2fd>   DW_AT_type        : <0x7c>
 <2><301>: Abbrev Number: 0
 <1><302>: Abbrev Number: 3 (DW_TAG_subprogram)
    <303>   DW_AT_external    : 1
    <303>   DW_AT_name        : (indirect string, offset: 0x70e15): semSemaphoreRelease
    <307>   DW_AT_decl_file   : 8
    <308>   DW_AT_decl_line   : 34
    <309>   DW_AT_decl_column : 6
    <30a>   DW_AT_prototyped  : 1
    <30a>   DW_AT_type        : <0x318>
    <30e>   DW_AT_declaration : 1
    <30e>   DW_AT_sibling     : <0x318>
 <2><312>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <313>   DW_AT_type        : <0xf7>
 <2><317>: Abbrev Number: 0
 <1><318>: Abbrev Number: 5 (DW_TAG_base_type)
    <319>   DW_AT_byte_size   : 1
    <31a>   DW_AT_encoding    : 2	(boolean)
    <31b>   DW_AT_name        : (indirect string, offset: 0x44759): _Bool
 <1><31f>: Abbrev Number: 3 (DW_TAG_subprogram)
    <320>   DW_AT_external    : 1
    <320>   DW_AT_name        : (indirect string, offset: 0x4a7ae): mqMQueuePutData
    <324>   DW_AT_decl_file   : 9
    <325>   DW_AT_decl_line   : 35
    <326>   DW_AT_decl_column : 6
    <327>   DW_AT_prototyped  : 1
    <327>   DW_AT_type        : <0x318>
    <32b>   DW_AT_declaration : 1
    <32b>   DW_AT_sibling     : <0x344>
 <2><32f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <330>   DW_AT_type        : <0x103>
 <2><334>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <335>   DW_AT_type        : <0x125>
 <2><339>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <33a>   DW_AT_type        : <0x13c>
 <2><33e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <33f>   DW_AT_type        : <0x154>
 <2><343>: Abbrev Number: 0
 <1><344>: Abbrev Number: 3 (DW_TAG_subprogram)
    <345>   DW_AT_external    : 1
    <345>   DW_AT_name        : (indirect string, offset: 0x8b6d): mutexMutexRelease
    <349>   DW_AT_decl_file   : 10
    <34a>   DW_AT_decl_line   : 32
    <34b>   DW_AT_decl_column : 6
    <34c>   DW_AT_prototyped  : 1
    <34c>   DW_AT_type        : <0x318>
    <350>   DW_AT_declaration : 1
    <350>   DW_AT_sibling     : <0x35a>
 <2><354>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <355>   DW_AT_type        : <0xeb>
 <2><359>: Abbrev Number: 0
 <1><35a>: Abbrev Number: 24 (DW_TAG_subprogram)
    <35b>   DW_AT_external    : 1
    <35b>   DW_AT_name        : (indirect string, offset: 0x5a2d): threadPrintError
    <35f>   DW_AT_decl_file   : 7
    <360>   DW_AT_decl_line   : 71
    <361>   DW_AT_decl_column : 6
    <362>   DW_AT_prototyped  : 1
    <362>   DW_AT_declaration : 1
    <362>   DW_AT_sibling     : <0x371>
 <2><366>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <367>   DW_AT_type        : <0x371>
 <2><36b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <36c>   DW_AT_type        : <0x2bd>
 <2><370>: Abbrev Number: 0
 <1><371>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <372>   DW_AT_byte_size   : 4
    <372>   DW_AT_type        : <0x137>
 <1><376>: Abbrev Number: 3 (DW_TAG_subprogram)
    <377>   DW_AT_external    : 1
    <377>   DW_AT_name        : (indirect string, offset: 0x11a96): strcpy
    <37b>   DW_AT_decl_file   : 11
    <37c>   DW_AT_decl_line   : 38
    <37d>   DW_AT_decl_column : 8
    <37e>   DW_AT_prototyped  : 1
    <37e>   DW_AT_type        : <0x120>
    <382>   DW_AT_declaration : 1
    <382>   DW_AT_sibling     : <0x391>
 <2><386>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <387>   DW_AT_type        : <0x120>
 <2><38b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <38c>   DW_AT_type        : <0x10f>
 <2><390>: Abbrev Number: 0
 <1><391>: Abbrev Number: 25 (DW_TAG_subprogram)
    <392>   DW_AT_external    : 1
    <392>   DW_AT_name        : (indirect string, offset: 0x3fe88): ledLedToggle
    <396>   DW_AT_decl_file   : 12
    <397>   DW_AT_decl_line   : 39
    <398>   DW_AT_decl_column : 6
    <399>   DW_AT_type        : <0x318>
    <39d>   DW_AT_declaration : 1
    <39d>   DW_AT_sibling     : <0x3a3>
 <2><3a1>: Abbrev Number: 14 (DW_TAG_unspecified_parameters)
 <2><3a2>: Abbrev Number: 0
 <1><3a3>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3a4>   DW_AT_external    : 1
    <3a4>   DW_AT_name        : (indirect string, offset: 0x61157): threadProcessMessage
    <3a8>   DW_AT_decl_file   : 7
    <3a9>   DW_AT_decl_line   : 70
    <3aa>   DW_AT_decl_column : 6
    <3ab>   DW_AT_prototyped  : 1
    <3ab>   DW_AT_type        : <0x318>
    <3af>   DW_AT_declaration : 1
    <3af>   DW_AT_sibling     : <0x3be>
 <2><3b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3b4>   DW_AT_type        : <0x371>
 <2><3b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3b9>   DW_AT_type        : <0x204>
 <2><3bd>: Abbrev Number: 0
 <1><3be>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3bf>   DW_AT_external    : 1
    <3bf>   DW_AT_name        : (indirect string, offset: 0x7bf6e): mutexMutexAcquire
    <3c3>   DW_AT_decl_file   : 10
    <3c4>   DW_AT_decl_line   : 31
    <3c5>   DW_AT_decl_column : 6
    <3c6>   DW_AT_prototyped  : 1
    <3c6>   DW_AT_type        : <0x318>
    <3ca>   DW_AT_declaration : 1
    <3ca>   DW_AT_sibling     : <0x3d9>
 <2><3ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3cf>   DW_AT_type        : <0xeb>
 <2><3d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3d4>   DW_AT_type        : <0x154>
 <2><3d8>: Abbrev Number: 0
 <1><3d9>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3da>   DW_AT_external    : 1
    <3da>   DW_AT_name        : (indirect string, offset: 0x6afc1): mqMQueueGetData
    <3de>   DW_AT_decl_file   : 9
    <3df>   DW_AT_decl_line   : 39
    <3e0>   DW_AT_decl_column : 6
    <3e1>   DW_AT_prototyped  : 1
    <3e1>   DW_AT_type        : <0x318>
    <3e5>   DW_AT_declaration : 1
    <3e5>   DW_AT_sibling     : <0x3fe>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3ea>   DW_AT_type        : <0x103>
 <2><3ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3ef>   DW_AT_type        : <0x9b>
 <2><3f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3f4>   DW_AT_type        : <0x13c>
 <2><3f8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3f9>   DW_AT_type        : <0x154>
 <2><3fd>: Abbrev Number: 0
 <1><3fe>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3ff>   DW_AT_external    : 1
    <3ff>   DW_AT_name        : (indirect string, offset: 0x1caac): mqMQueueDataCount
    <403>   DW_AT_decl_file   : 9
    <404>   DW_AT_decl_line   : 43
    <405>   DW_AT_decl_column : 6
    <406>   DW_AT_prototyped  : 1
    <406>   DW_AT_type        : <0x318>
    <40a>   DW_AT_declaration : 1
    <40a>   DW_AT_sibling     : <0x419>
 <2><40e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <40f>   DW_AT_type        : <0x103>
 <2><413>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <414>   DW_AT_type        : <0x419>
 <2><418>: Abbrev Number: 0
 <1><419>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <41a>   DW_AT_byte_size   : 4
    <41a>   DW_AT_type        : <0x154>
 <1><41e>: Abbrev Number: 3 (DW_TAG_subprogram)
    <41f>   DW_AT_external    : 1
    <41f>   DW_AT_name        : (indirect string, offset: 0x43efd): semSemaphoreAcquire
    <423>   DW_AT_decl_file   : 8
    <424>   DW_AT_decl_line   : 33
    <425>   DW_AT_decl_column : 6
    <426>   DW_AT_prototyped  : 1
    <426>   DW_AT_type        : <0x318>
    <42a>   DW_AT_declaration : 1
    <42a>   DW_AT_sibling     : <0x439>
 <2><42e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <42f>   DW_AT_type        : <0xf7>
 <2><433>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <434>   DW_AT_type        : <0x154>
 <2><438>: Abbrev Number: 0
 <1><439>: Abbrev Number: 3 (DW_TAG_subprogram)
    <43a>   DW_AT_external    : 1
    <43a>   DW_AT_name        : (indirect string, offset: 0x6f4e0): consoleSerialPrint
    <43e>   DW_AT_decl_file   : 13
    <43f>   DW_AT_decl_line   : 34
    <440>   DW_AT_decl_column : 6
    <441>   DW_AT_prototyped  : 1
    <441>   DW_AT_type        : <0x318>
    <445>   DW_AT_declaration : 1
    <445>   DW_AT_sibling     : <0x459>
 <2><449>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <44a>   DW_AT_type        : <0x459>
 <2><44e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <44f>   DW_AT_type        : <0x148>
 <2><453>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <454>   DW_AT_type        : <0x154>
 <2><458>: Abbrev Number: 0
 <1><459>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <45a>   DW_AT_byte_size   : 4
    <45a>   DW_AT_type        : <0x12b>
 <1><45e>: Abbrev Number: 3 (DW_TAG_subprogram)
    <45f>   DW_AT_external    : 1
    <45f>   DW_AT_name        : (indirect string, offset: 0x2e139): strlen
    <463>   DW_AT_decl_file   : 11
    <464>   DW_AT_decl_line   : 41
    <465>   DW_AT_decl_column : 9
    <466>   DW_AT_prototyped  : 1
    <466>   DW_AT_type        : <0x88>
    <46a>   DW_AT_declaration : 1
    <46a>   DW_AT_sibling     : <0x474>
 <2><46e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <46f>   DW_AT_type        : <0x10f>
 <2><473>: Abbrev Number: 0
 <1><474>: Abbrev Number: 3 (DW_TAG_subprogram)
    <475>   DW_AT_external    : 1
    <475>   DW_AT_name        : (indirect string, offset: 0x76cc7): sprintf
    <479>   DW_AT_decl_file   : 14
    <47a>   DW_AT_decl_line   : 250
    <47b>   DW_AT_decl_column : 5
    <47c>   DW_AT_prototyped  : 1
    <47c>   DW_AT_type        : <0x6e>
    <480>   DW_AT_declaration : 1
    <480>   DW_AT_sibling     : <0x490>
 <2><484>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <485>   DW_AT_type        : <0x120>
 <2><489>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <48a>   DW_AT_type        : <0x10f>
 <2><48e>: Abbrev Number: 14 (DW_TAG_unspecified_parameters)
 <2><48f>: Abbrev Number: 0
 <1><490>: Abbrev Number: 3 (DW_TAG_subprogram)
    <491>   DW_AT_external    : 1
    <491>   DW_AT_name        : (indirect string, offset: 0x800d6): memset
    <495>   DW_AT_decl_file   : 11
    <496>   DW_AT_decl_line   : 33
    <497>   DW_AT_decl_column : 9
    <498>   DW_AT_prototyped  : 1
    <498>   DW_AT_type        : <0x9b>
    <49c>   DW_AT_declaration : 1
    <49c>   DW_AT_sibling     : <0x4b0>
 <2><4a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4a1>   DW_AT_type        : <0x9b>
 <2><4a5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4a6>   DW_AT_type        : <0x6e>
 <2><4aa>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4ab>   DW_AT_type        : <0x88>
 <2><4af>: Abbrev Number: 0
 <1><4b0>: Abbrev Number: 3 (DW_TAG_subprogram)
    <4b1>   DW_AT_external    : 1
    <4b1>   DW_AT_name        : (indirect string, offset: 0x69f57): memcpy
    <4b5>   DW_AT_decl_file   : 11
    <4b6>   DW_AT_decl_line   : 31
    <4b7>   DW_AT_decl_column : 9
    <4b8>   DW_AT_prototyped  : 1
    <4b8>   DW_AT_type        : <0x9b>
    <4bc>   DW_AT_declaration : 1
    <4bc>   DW_AT_sibling     : <0x4d0>
 <2><4c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4c1>   DW_AT_type        : <0x9b>
 <2><4c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4c6>   DW_AT_type        : <0x125>
 <2><4ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4cb>   DW_AT_type        : <0x88>
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 26 (DW_TAG_subprogram)
    <4d1>   DW_AT_external    : 1
    <4d1>   DW_AT_name        : (indirect string, offset: 0x7d27d): blinkTaskBlink
    <4d5>   DW_AT_decl_file   : 1
    <4d6>   DW_AT_decl_line   : 33
    <4d7>   DW_AT_decl_column : 6
    <4d8>   DW_AT_prototyped  : 1
    <4d8>   DW_AT_low_pc      : 0x8000160
    <4dc>   DW_AT_high_pc     : 0x1e8
    <4e0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4e2>   DW_AT_call_all_tail_calls: 1
    <4e2>   DW_AT_sibling     : <0x541>
 <2><4e6>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x3b7a0): pvParameter
    <4eb>   DW_AT_decl_file   : 1
    <4ec>   DW_AT_decl_line   : 33
    <4ed>   DW_AT_decl_column : 27
    <4ee>   DW_AT_type        : <0x9b>
    <4f2>   DW_AT_location    : 3 byte block: 91 d4 7e 	(DW_OP_fbreg: -172)
 <2><4f6>: Abbrev Number: 11 (DW_TAG_variable)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x7d5e4): stTaskParameter
    <4fb>   DW_AT_decl_file   : 1
    <4fb>   DW_AT_decl_line   : 35
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0x19c>
    <501>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><504>: Abbrev Number: 11 (DW_TAG_variable)
    <505>   DW_AT_name        : (indirect string, offset: 0x41f1b): stMessageData
    <509>   DW_AT_decl_file   : 1
    <509>   DW_AT_decl_line   : 36
    <50a>   DW_AT_decl_column : 10
    <50b>   DW_AT_type        : <0x204>
    <50f>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><513>: Abbrev Number: 11 (DW_TAG_variable)
    <514>   DW_AT_name        : (indirect string, offset: 0x8209c): stAckData
    <518>   DW_AT_decl_file   : 1
    <518>   DW_AT_decl_line   : 37
    <519>   DW_AT_decl_column : 14
    <51a>   DW_AT_type        : <0x268>
    <51e>   DW_AT_location    : 3 byte block: 91 e0 7e 	(DW_OP_fbreg: -160)
 <2><522>: Abbrev Number: 11 (DW_TAG_variable)
    <523>   DW_AT_name        : (indirect string, offset: 0x42a4c): ulMessageCount
    <527>   DW_AT_decl_file   : 1
    <527>   DW_AT_decl_line   : 38
    <528>   DW_AT_decl_column : 9
    <529>   DW_AT_type        : <0x154>
    <52d>   DW_AT_location    : 3 byte block: 91 dc 7e 	(DW_OP_fbreg: -164)
 <2><531>: Abbrev Number: 28 (DW_TAG_variable)
    <532>   DW_AT_name        : (indirect string, offset: 0x23be7): __func__
    <536>   DW_AT_type        : <0x551>
    <53a>   DW_AT_artificial  : 1
    <53a>   DW_AT_location    : 5 byte block: 3 4 79 0 8 	(DW_OP_addr: 8007904)
 <2><540>: Abbrev Number: 0
 <1><541>: Abbrev Number: 9 (DW_TAG_array_type)
    <542>   DW_AT_type        : <0x11b>
    <546>   DW_AT_sibling     : <0x551>
 <2><54a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <54b>   DW_AT_type        : <0x75>
    <54f>   DW_AT_upper_bound : 14
 <2><550>: Abbrev Number: 0
 <1><551>: Abbrev Number: 12 (DW_TAG_const_type)
    <552>   DW_AT_type        : <0x541>
 <1><556>: Abbrev Number: 0
  Compilation Unit @ offset 0x557:
   Length:        0x612 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x194
   Pointer Size:  4
 <0><563>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <564>   DW_AT_producer    : (indirect string, offset: 0x86d05): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <568>   DW_AT_language    : 29	(C11)
    <569>   DW_AT_name        : (indirect string, offset: 0x87534): ../Core/Console/Console.c
    <56d>   DW_AT_comp_dir    : (indirect string, offset: 0x7bd3a): F:/WorkSpace/stmDemoApp/Debug
    <571>   DW_AT_ranges      : 0x20
    <575>   DW_AT_low_pc      : 0
    <579>   DW_AT_stmt_list   : 0xb27
    <57d>   DW_AT_macros      : 0x1669b
 <1><581>: Abbrev Number: 4 (DW_TAG_base_type)
    <582>   DW_AT_byte_size   : 1
    <583>   DW_AT_encoding    : 6	(signed char)
    <584>   DW_AT_name        : (indirect string, offset: 0x43ac5): signed char
 <1><588>: Abbrev Number: 2 (DW_TAG_typedef)
    <589>   DW_AT_name        : (indirect string, offset: 0x87489): __uint8_t
    <58d>   DW_AT_decl_file   : 2
    <58e>   DW_AT_decl_line   : 43
    <58f>   DW_AT_decl_column : 24
    <590>   DW_AT_type        : <0x594>
 <1><594>: Abbrev Number: 4 (DW_TAG_base_type)
    <595>   DW_AT_byte_size   : 1
    <596>   DW_AT_encoding    : 8	(unsigned char)
    <597>   DW_AT_name        : (indirect string, offset: 0x1b3be): unsigned char
 <1><59b>: Abbrev Number: 4 (DW_TAG_base_type)
    <59c>   DW_AT_byte_size   : 2
    <59d>   DW_AT_encoding    : 5	(signed)
    <59e>   DW_AT_name        : (indirect string, offset: 0x64f0a): short int
 <1><5a2>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x87688): __uint16_t
    <5a7>   DW_AT_decl_file   : 2
    <5a8>   DW_AT_decl_line   : 57
    <5a9>   DW_AT_decl_column : 25
    <5aa>   DW_AT_type        : <0x5ae>
 <1><5ae>: Abbrev Number: 4 (DW_TAG_base_type)
    <5af>   DW_AT_byte_size   : 2
    <5b0>   DW_AT_encoding    : 7	(unsigned)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x2c27c): short unsigned int
 <1><5b5>: Abbrev Number: 4 (DW_TAG_base_type)
    <5b6>   DW_AT_byte_size   : 4
    <5b7>   DW_AT_encoding    : 5	(signed)
    <5b8>   DW_AT_name        : (indirect string, offset: 0xbe94): long int
 <1><5bc>: Abbrev Number: 2 (DW_TAG_typedef)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x560aa): __uint32_t
    <5c1>   DW_AT_decl_file   : 2
    <5c2>   DW_AT_decl_line   : 79
    <5c3>   DW_AT_decl_column : 25
    <5c4>   DW_AT_type        : <0x5c8>
 <1><5c8>: Abbrev Number: 4 (DW_TAG_base_type)
    <5c9>   DW_AT_byte_size   : 4
    <5ca>   DW_AT_encoding    : 7	(unsigned)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x1faf8): long unsigned int
 <1><5cf>: Abbrev Number: 4 (DW_TAG_base_type)
    <5d0>   DW_AT_byte_size   : 8
    <5d1>   DW_AT_encoding    : 5	(signed)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x3e0a1): long long int
 <1><5d6>: Abbrev Number: 4 (DW_TAG_base_type)
    <5d7>   DW_AT_byte_size   : 8
    <5d8>   DW_AT_encoding    : 7	(unsigned)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x1bcc1): long long unsigned int
 <1><5dd>: Abbrev Number: 19 (DW_TAG_base_type)
    <5de>   DW_AT_byte_size   : 4
    <5df>   DW_AT_encoding    : 5	(signed)
    <5e0>   DW_AT_name        : int
 <1><5e4>: Abbrev Number: 4 (DW_TAG_base_type)
    <5e5>   DW_AT_byte_size   : 4
    <5e6>   DW_AT_encoding    : 7	(unsigned)
    <5e7>   DW_AT_name        : (indirect string, offset: 0xb844): unsigned int
 <1><5eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x8748b): uint8_t
    <5f0>   DW_AT_decl_file   : 3
    <5f1>   DW_AT_decl_line   : 24
    <5f2>   DW_AT_decl_column : 19
    <5f3>   DW_AT_type        : <0x588>
 <1><5f7>: Abbrev Number: 20 (DW_TAG_const_type)
    <5f8>   DW_AT_type        : <0x5eb>
 <1><5fc>: Abbrev Number: 2 (DW_TAG_typedef)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x8b53b): uint16_t
    <601>   DW_AT_decl_file   : 3
    <602>   DW_AT_decl_line   : 36
    <603>   DW_AT_decl_column : 20
    <604>   DW_AT_type        : <0x5a2>
 <1><608>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <609>   DW_AT_type        : <0x5fc>
 <1><60d>: Abbrev Number: 2 (DW_TAG_typedef)
    <60e>   DW_AT_name        : (indirect string, offset: 0x8b500): uint32_t
    <612>   DW_AT_decl_file   : 3
    <613>   DW_AT_decl_line   : 48
    <614>   DW_AT_decl_column : 20
    <615>   DW_AT_type        : <0x5bc>
 <1><619>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <61a>   DW_AT_type        : <0x60d>
 <1><61e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <61f>   DW_AT_byte_size   : 16
    <620>   DW_AT_decl_file   : 4
    <620>   DW_AT_decl_line   : 290
    <622>   DW_AT_decl_column : 9
    <622>   DW_AT_sibling     : <0x657>
 <2><626>: Abbrev Number: 6 (DW_TAG_member)
    <627>   DW_AT_name        : CCR
    <62b>   DW_AT_decl_file   : 4
    <62b>   DW_AT_decl_line   : 292
    <62d>   DW_AT_decl_column : 17
    <62d>   DW_AT_type        : <0x619>
    <631>   DW_AT_data_member_location: 0
 <2><632>: Abbrev Number: 9 (DW_TAG_member)
    <633>   DW_AT_name        : (indirect string, offset: 0x874d0): CNDTR
    <637>   DW_AT_decl_file   : 4
    <637>   DW_AT_decl_line   : 293
    <639>   DW_AT_decl_column : 17
    <639>   DW_AT_type        : <0x619>
    <63d>   DW_AT_data_member_location: 4
 <2><63e>: Abbrev Number: 9 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x87741): CPAR
    <643>   DW_AT_decl_file   : 4
    <643>   DW_AT_decl_line   : 294
    <645>   DW_AT_decl_column : 17
    <645>   DW_AT_type        : <0x619>
    <649>   DW_AT_data_member_location: 8
 <2><64a>: Abbrev Number: 9 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0x875b0): CMAR
    <64f>   DW_AT_decl_file   : 4
    <64f>   DW_AT_decl_line   : 295
    <651>   DW_AT_decl_column : 17
    <651>   DW_AT_type        : <0x619>
    <655>   DW_AT_data_member_location: 12
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 11 (DW_TAG_typedef)
    <658>   DW_AT_name        : (indirect string, offset: 0x87674): DMA_Channel_TypeDef
    <65c>   DW_AT_decl_file   : 4
    <65c>   DW_AT_decl_line   : 296
    <65e>   DW_AT_decl_column : 3
    <65e>   DW_AT_type        : <0x61e>
 <1><662>: Abbrev Number: 10 (DW_TAG_structure_type)
    <663>   DW_AT_byte_size   : 8
    <664>   DW_AT_decl_file   : 4
    <664>   DW_AT_decl_line   : 298
    <666>   DW_AT_decl_column : 9
    <666>   DW_AT_sibling     : <0x683>
 <2><66a>: Abbrev Number: 6 (DW_TAG_member)
    <66b>   DW_AT_name        : ISR
    <66f>   DW_AT_decl_file   : 4
    <66f>   DW_AT_decl_line   : 300
    <671>   DW_AT_decl_column : 17
    <671>   DW_AT_type        : <0x619>
    <675>   DW_AT_data_member_location: 0
 <2><676>: Abbrev Number: 9 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x8762d): IFCR
    <67b>   DW_AT_decl_file   : 4
    <67b>   DW_AT_decl_line   : 301
    <67d>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x619>
    <681>   DW_AT_data_member_location: 4
 <2><682>: Abbrev Number: 0
 <1><683>: Abbrev Number: 11 (DW_TAG_typedef)
    <684>   DW_AT_name        : (indirect string, offset: 0x874ba): DMA_TypeDef
    <688>   DW_AT_decl_file   : 4
    <688>   DW_AT_decl_line   : 302
    <68a>   DW_AT_decl_column : 3
    <68a>   DW_AT_type        : <0x662>
 <1><68e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <68f>   DW_AT_byte_size   : 28
    <690>   DW_AT_decl_file   : 4
    <690>   DW_AT_decl_line   : 506
    <692>   DW_AT_decl_column : 9
    <692>   DW_AT_sibling     : <0x6e9>
 <2><696>: Abbrev Number: 6 (DW_TAG_member)
    <697>   DW_AT_name        : SR
    <69a>   DW_AT_decl_file   : 4
    <69a>   DW_AT_decl_line   : 508
    <69c>   DW_AT_decl_column : 17
    <69c>   DW_AT_type        : <0x619>
    <6a0>   DW_AT_data_member_location: 0
 <2><6a1>: Abbrev Number: 6 (DW_TAG_member)
    <6a2>   DW_AT_name        : DR
    <6a5>   DW_AT_decl_file   : 4
    <6a5>   DW_AT_decl_line   : 509
    <6a7>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x619>
    <6ab>   DW_AT_data_member_location: 4
 <2><6ac>: Abbrev Number: 6 (DW_TAG_member)
    <6ad>   DW_AT_name        : BRR
    <6b1>   DW_AT_decl_file   : 4
    <6b1>   DW_AT_decl_line   : 510
    <6b3>   DW_AT_decl_column : 17
    <6b3>   DW_AT_type        : <0x619>
    <6b7>   DW_AT_data_member_location: 8
 <2><6b8>: Abbrev Number: 6 (DW_TAG_member)
    <6b9>   DW_AT_name        : CR1
    <6bd>   DW_AT_decl_file   : 4
    <6bd>   DW_AT_decl_line   : 511
    <6bf>   DW_AT_decl_column : 17
    <6bf>   DW_AT_type        : <0x619>
    <6c3>   DW_AT_data_member_location: 12
 <2><6c4>: Abbrev Number: 6 (DW_TAG_member)
    <6c5>   DW_AT_name        : CR2
    <6c9>   DW_AT_decl_file   : 4
    <6c9>   DW_AT_decl_line   : 512
    <6cb>   DW_AT_decl_column : 17
    <6cb>   DW_AT_type        : <0x619>
    <6cf>   DW_AT_data_member_location: 16
 <2><6d0>: Abbrev Number: 6 (DW_TAG_member)
    <6d1>   DW_AT_name        : CR3
    <6d5>   DW_AT_decl_file   : 4
    <6d5>   DW_AT_decl_line   : 513
    <6d7>   DW_AT_decl_column : 17
    <6d7>   DW_AT_type        : <0x619>
    <6db>   DW_AT_data_member_location: 20
 <2><6dc>: Abbrev Number: 9 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x87473): GTPR
    <6e1>   DW_AT_decl_file   : 4
    <6e1>   DW_AT_decl_line   : 514
    <6e3>   DW_AT_decl_column : 17
    <6e3>   DW_AT_type        : <0x619>
    <6e7>   DW_AT_data_member_location: 24
 <2><6e8>: Abbrev Number: 0
 <1><6e9>: Abbrev Number: 11 (DW_TAG_typedef)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x87774): USART_TypeDef
    <6ee>   DW_AT_decl_file   : 4
    <6ee>   DW_AT_decl_line   : 515
    <6f0>   DW_AT_decl_column : 3
    <6f0>   DW_AT_type        : <0x68e>
 <1><6f4>: Abbrev Number: 4 (DW_TAG_base_type)
    <6f5>   DW_AT_byte_size   : 8
    <6f6>   DW_AT_encoding    : 4	(float)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xcf6f): long double
 <1><6fb>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <6fc>   DW_AT_encoding    : 7	(unsigned)
    <6fc>   DW_AT_byte_size   : 1
    <6fc>   DW_AT_type        : <0x594>
    <700>   DW_AT_decl_file   : 5
    <701>   DW_AT_decl_line   : 50
    <702>   DW_AT_decl_column : 1
    <702>   DW_AT_sibling     : <0x713>
 <2><706>: Abbrev Number: 3 (DW_TAG_enumerator)
    <707>   DW_AT_name        : (indirect string, offset: 0x87632): HAL_UNLOCKED
    <70b>   DW_AT_const_value : 0
 <2><70c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <70d>   DW_AT_name        : (indirect string, offset: 0x87793): HAL_LOCKED
    <711>   DW_AT_const_value : 1
 <2><712>: Abbrev Number: 0
 <1><713>: Abbrev Number: 2 (DW_TAG_typedef)
    <714>   DW_AT_name        : (indirect string, offset: 0x875ca): HAL_LockTypeDef
    <718>   DW_AT_decl_file   : 5
    <719>   DW_AT_decl_line   : 53
    <71a>   DW_AT_decl_column : 3
    <71b>   DW_AT_type        : <0x6fb>
 <1><71f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <720>   DW_AT_byte_size   : 28
    <720>   DW_AT_decl_file   : 6
    <721>   DW_AT_decl_line   : 47
    <722>   DW_AT_decl_column : 9
    <722>   DW_AT_sibling     : <0x782>
 <2><726>: Abbrev Number: 1 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x874c6): Direction
    <72b>   DW_AT_decl_file   : 6
    <72c>   DW_AT_decl_line   : 49
    <72d>   DW_AT_decl_column : 12
    <72e>   DW_AT_type        : <0x60d>
    <732>   DW_AT_data_member_location: 0
 <2><733>: Abbrev Number: 1 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x873ca): PeriphInc
    <738>   DW_AT_decl_file   : 6
    <739>   DW_AT_decl_line   : 53
    <73a>   DW_AT_decl_column : 12
    <73b>   DW_AT_type        : <0x60d>
    <73f>   DW_AT_data_member_location: 4
 <2><740>: Abbrev Number: 1 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x87421): MemInc
    <745>   DW_AT_decl_file   : 6
    <746>   DW_AT_decl_line   : 56
    <747>   DW_AT_decl_column : 12
    <748>   DW_AT_type        : <0x60d>
    <74c>   DW_AT_data_member_location: 8
 <2><74d>: Abbrev Number: 1 (DW_TAG_member)
    <74e>   DW_AT_name        : (indirect string, offset: 0x87587): PeriphDataAlignment
    <752>   DW_AT_decl_file   : 6
    <753>   DW_AT_decl_line   : 59
    <754>   DW_AT_decl_column : 12
    <755>   DW_AT_type        : <0x60d>
    <759>   DW_AT_data_member_location: 12
 <2><75a>: Abbrev Number: 1 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x876e6): MemDataAlignment
    <75f>   DW_AT_decl_file   : 6
    <760>   DW_AT_decl_line   : 62
    <761>   DW_AT_decl_column : 12
    <762>   DW_AT_type        : <0x60d>
    <766>   DW_AT_data_member_location: 16
 <2><767>: Abbrev Number: 1 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x8ea53): Mode
    <76c>   DW_AT_decl_file   : 6
    <76d>   DW_AT_decl_line   : 65
    <76e>   DW_AT_decl_column : 12
    <76f>   DW_AT_type        : <0x60d>
    <773>   DW_AT_data_member_location: 20
 <2><774>: Abbrev Number: 1 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x8dd9d): Priority
    <779>   DW_AT_decl_file   : 6
    <77a>   DW_AT_decl_line   : 70
    <77b>   DW_AT_decl_column : 12
    <77c>   DW_AT_type        : <0x60d>
    <780>   DW_AT_data_member_location: 24
 <2><781>: Abbrev Number: 0
 <1><782>: Abbrev Number: 2 (DW_TAG_typedef)
    <783>   DW_AT_name        : (indirect string, offset: 0x8744f): DMA_InitTypeDef
    <787>   DW_AT_decl_file   : 6
    <788>   DW_AT_decl_line   : 72
    <789>   DW_AT_decl_column : 3
    <78a>   DW_AT_type        : <0x71f>
 <1><78e>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <78f>   DW_AT_encoding    : 7	(unsigned)
    <78f>   DW_AT_byte_size   : 1
    <78f>   DW_AT_type        : <0x594>
    <793>   DW_AT_decl_file   : 6
    <794>   DW_AT_decl_line   : 78
    <795>   DW_AT_decl_column : 1
    <795>   DW_AT_sibling     : <0x7b2>
 <2><799>: Abbrev Number: 3 (DW_TAG_enumerator)
    <79a>   DW_AT_name        : (indirect string, offset: 0x8763f): HAL_DMA_STATE_RESET
    <79e>   DW_AT_const_value : 0
 <2><79f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x8745f): HAL_DMA_STATE_READY
    <7a4>   DW_AT_const_value : 1
 <2><7a5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x87605): HAL_DMA_STATE_BUSY
    <7aa>   DW_AT_const_value : 2
 <2><7ab>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x8775e): HAL_DMA_STATE_TIMEOUT
    <7b0>   DW_AT_const_value : 3
 <2><7b1>: Abbrev Number: 0
 <1><7b2>: Abbrev Number: 2 (DW_TAG_typedef)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x8759b): HAL_DMA_StateTypeDef
    <7b7>   DW_AT_decl_file   : 6
    <7b8>   DW_AT_decl_line   : 83
    <7b9>   DW_AT_decl_column : 2
    <7ba>   DW_AT_type        : <0x78e>
 <1><7be>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <7bf>   DW_AT_type        : <0x7b2>
 <1><7c3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x876c1): __DMA_HandleTypeDef
    <7c8>   DW_AT_byte_size   : 68
    <7c9>   DW_AT_decl_file   : 6
    <7ca>   DW_AT_decl_line   : 110
    <7cb>   DW_AT_decl_column : 16
    <7cb>   DW_AT_sibling     : <0x86c>
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x874d6): Instance
    <7d4>   DW_AT_decl_file   : 6
    <7d5>   DW_AT_decl_line   : 112
    <7d6>   DW_AT_decl_column : 31
    <7d7>   DW_AT_type        : <0x86c>
    <7db>   DW_AT_data_member_location: 0
 <2><7dc>: Abbrev Number: 1 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x8e83a): Init
    <7e1>   DW_AT_decl_file   : 6
    <7e2>   DW_AT_decl_line   : 114
    <7e3>   DW_AT_decl_column : 30
    <7e4>   DW_AT_type        : <0x782>
    <7e8>   DW_AT_data_member_location: 4
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x60b0c): Lock
    <7ee>   DW_AT_decl_file   : 6
    <7ef>   DW_AT_decl_line   : 116
    <7f0>   DW_AT_decl_column : 30
    <7f1>   DW_AT_type        : <0x713>
    <7f5>   DW_AT_data_member_location: 32
 <2><7f6>: Abbrev Number: 1 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x8d382): State
    <7fb>   DW_AT_decl_file   : 6
    <7fc>   DW_AT_decl_line   : 118
    <7fd>   DW_AT_decl_column : 30
    <7fe>   DW_AT_type        : <0x7be>
    <802>   DW_AT_data_member_location: 33
 <2><803>: Abbrev Number: 1 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0x8773a): Parent
    <808>   DW_AT_decl_file   : 6
    <809>   DW_AT_decl_line   : 120
    <80a>   DW_AT_decl_column : 31
    <80b>   DW_AT_type        : <0x871>
    <80f>   DW_AT_data_member_location: 36
 <2><810>: Abbrev Number: 1 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0x87782): XferCpltCallback
    <815>   DW_AT_decl_file   : 6
    <816>   DW_AT_decl_line   : 122
    <817>   DW_AT_decl_column : 33
    <818>   DW_AT_type        : <0x883>
    <81c>   DW_AT_data_member_location: 40
 <2><81d>: Abbrev Number: 1 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0x8765f): XferHalfCpltCallback
    <822>   DW_AT_decl_file   : 6
    <823>   DW_AT_decl_line   : 124
    <824>   DW_AT_decl_column : 33
    <825>   DW_AT_type        : <0x883>
    <829>   DW_AT_data_member_location: 44
 <2><82a>: Abbrev Number: 1 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x8740f): XferErrorCallback
    <82f>   DW_AT_decl_file   : 6
    <830>   DW_AT_decl_line   : 126
    <831>   DW_AT_decl_column : 33
    <832>   DW_AT_type        : <0x883>
    <836>   DW_AT_data_member_location: 48
 <2><837>: Abbrev Number: 1 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x87728): XferAbortCallback
    <83c>   DW_AT_decl_file   : 6
    <83d>   DW_AT_decl_line   : 128
    <83e>   DW_AT_decl_column : 33
    <83f>   DW_AT_type        : <0x883>
    <843>   DW_AT_data_member_location: 52
 <2><844>: Abbrev Number: 1 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x87754): ErrorCode
    <849>   DW_AT_decl_file   : 6
    <84a>   DW_AT_decl_line   : 130
    <84b>   DW_AT_decl_column : 30
    <84c>   DW_AT_type        : <0x619>
    <850>   DW_AT_data_member_location: 56
 <2><851>: Abbrev Number: 1 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0x8751d): DmaBaseAddress
    <856>   DW_AT_decl_file   : 6
    <857>   DW_AT_decl_line   : 132
    <858>   DW_AT_decl_column : 31
    <859>   DW_AT_type        : <0x888>
    <85d>   DW_AT_data_member_location: 60
 <2><85e>: Abbrev Number: 1 (DW_TAG_member)
    <85f>   DW_AT_name        : (indirect string, offset: 0x87428): ChannelIndex
    <863>   DW_AT_decl_file   : 6
    <864>   DW_AT_decl_line   : 134
    <865>   DW_AT_decl_column : 30
    <866>   DW_AT_type        : <0x60d>
    <86a>   DW_AT_data_member_location: 64
 <2><86b>: Abbrev Number: 0
 <1><86c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <86d>   DW_AT_byte_size   : 4
    <86d>   DW_AT_type        : <0x657>
 <1><871>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <872>   DW_AT_byte_size   : 4
 <1><873>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <874>   DW_AT_prototyped  : 1
    <874>   DW_AT_sibling     : <0x87e>
 <2><878>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <879>   DW_AT_type        : <0x87e>
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <87f>   DW_AT_byte_size   : 4
    <87f>   DW_AT_type        : <0x7c3>
 <1><883>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <884>   DW_AT_byte_size   : 4
    <884>   DW_AT_type        : <0x873>
 <1><888>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <889>   DW_AT_byte_size   : 4
    <889>   DW_AT_type        : <0x683>
 <1><88d>: Abbrev Number: 2 (DW_TAG_typedef)
    <88e>   DW_AT_name        : (indirect string, offset: 0x876c3): DMA_HandleTypeDef
    <892>   DW_AT_decl_file   : 6
    <893>   DW_AT_decl_line   : 136
    <894>   DW_AT_decl_column : 3
    <895>   DW_AT_type        : <0x7c3>
 <1><899>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <89a>   DW_AT_byte_size   : 4
    <89a>   DW_AT_type        : <0x88d>
 <1><89e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <89f>   DW_AT_byte_size   : 28
    <89f>   DW_AT_decl_file   : 7
    <8a0>   DW_AT_decl_line   : 46
    <8a1>   DW_AT_decl_column : 9
    <8a1>   DW_AT_sibling     : <0x901>
 <2><8a5>: Abbrev Number: 1 (DW_TAG_member)
    <8a6>   DW_AT_name        : (indirect string, offset: 0x8770b): BaudRate
    <8aa>   DW_AT_decl_file   : 7
    <8ab>   DW_AT_decl_line   : 48
    <8ac>   DW_AT_decl_column : 12
    <8ad>   DW_AT_type        : <0x60d>
    <8b1>   DW_AT_data_member_location: 0
 <2><8b2>: Abbrev Number: 1 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x873bf): WordLength
    <8b7>   DW_AT_decl_file   : 7
    <8b8>   DW_AT_decl_line   : 53
    <8b9>   DW_AT_decl_column : 12
    <8ba>   DW_AT_type        : <0x60d>
    <8be>   DW_AT_data_member_location: 4
 <2><8bf>: Abbrev Number: 1 (DW_TAG_member)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x87714): StopBits
    <8c4>   DW_AT_decl_file   : 7
    <8c5>   DW_AT_decl_line   : 56
    <8c6>   DW_AT_decl_column : 12
    <8c7>   DW_AT_type        : <0x60d>
    <8cb>   DW_AT_data_member_location: 8
 <2><8cc>: Abbrev Number: 1 (DW_TAG_member)
    <8cd>   DW_AT_name        : (indirect string, offset: 0x874b3): Parity
    <8d1>   DW_AT_decl_file   : 7
    <8d2>   DW_AT_decl_line   : 59
    <8d3>   DW_AT_decl_column : 12
    <8d4>   DW_AT_type        : <0x60d>
    <8d8>   DW_AT_data_member_location: 12
 <2><8d9>: Abbrev Number: 1 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0x8ea53): Mode
    <8de>   DW_AT_decl_file   : 7
    <8df>   DW_AT_decl_line   : 66
    <8e0>   DW_AT_decl_column : 12
    <8e1>   DW_AT_type        : <0x60d>
    <8e5>   DW_AT_data_member_location: 16
 <2><8e6>: Abbrev Number: 1 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x873e9): HwFlowCtl
    <8eb>   DW_AT_decl_file   : 7
    <8ec>   DW_AT_decl_line   : 69
    <8ed>   DW_AT_decl_column : 12
    <8ee>   DW_AT_type        : <0x60d>
    <8f2>   DW_AT_data_member_location: 20
 <2><8f3>: Abbrev Number: 1 (DW_TAG_member)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x876ab): OverSampling
    <8f8>   DW_AT_decl_file   : 7
    <8f9>   DW_AT_decl_line   : 72
    <8fa>   DW_AT_decl_column : 12
    <8fb>   DW_AT_type        : <0x60d>
    <8ff>   DW_AT_data_member_location: 24
 <2><900>: Abbrev Number: 0
 <1><901>: Abbrev Number: 2 (DW_TAG_typedef)
    <902>   DW_AT_name        : (indirect string, offset: 0x87478): UART_InitTypeDef
    <906>   DW_AT_decl_file   : 7
    <907>   DW_AT_decl_line   : 75
    <908>   DW_AT_decl_column : 3
    <909>   DW_AT_type        : <0x89e>
 <1><90d>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <90e>   DW_AT_encoding    : 7	(unsigned)
    <90e>   DW_AT_byte_size   : 1
    <90e>   DW_AT_type        : <0x594>
    <912>   DW_AT_decl_file   : 7
    <913>   DW_AT_decl_line   : 117
    <914>   DW_AT_decl_column : 1
    <914>   DW_AT_sibling     : <0x949>
 <2><918>: Abbrev Number: 3 (DW_TAG_enumerator)
    <919>   DW_AT_name        : (indirect string, offset: 0x87508): HAL_UART_STATE_RESET
    <91d>   DW_AT_const_value : 0
 <2><91e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <91f>   DW_AT_name        : (indirect string, offset: 0x873d4): HAL_UART_STATE_READY
    <923>   DW_AT_const_value : 32
 <2><924>: Abbrev Number: 3 (DW_TAG_enumerator)
    <925>   DW_AT_name        : (indirect string, offset: 0x876f7): HAL_UART_STATE_BUSY
    <929>   DW_AT_const_value : 36
 <2><92a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <92b>   DW_AT_name        : (indirect string, offset: 0x873a8): HAL_UART_STATE_BUSY_TX
    <92f>   DW_AT_const_value : 33
 <2><930>: Abbrev Number: 3 (DW_TAG_enumerator)
    <931>   DW_AT_name        : (indirect string, offset: 0x87391): HAL_UART_STATE_BUSY_RX
    <935>   DW_AT_const_value : 34
 <2><936>: Abbrev Number: 3 (DW_TAG_enumerator)
    <937>   DW_AT_name        : (indirect string, offset: 0x87435): HAL_UART_STATE_BUSY_TX_RX
    <93b>   DW_AT_const_value : 35
 <2><93c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <93d>   DW_AT_name        : (indirect string, offset: 0x87570): HAL_UART_STATE_TIMEOUT
    <941>   DW_AT_const_value : 160
 <2><942>: Abbrev Number: 3 (DW_TAG_enumerator)
    <943>   DW_AT_name        : (indirect string, offset: 0x87618): HAL_UART_STATE_ERROR
    <947>   DW_AT_const_value : 224
 <2><948>: Abbrev Number: 0
 <1><949>: Abbrev Number: 2 (DW_TAG_typedef)
    <94a>   DW_AT_name        : (indirect string, offset: 0x8749d): HAL_UART_StateTypeDef
    <94e>   DW_AT_decl_file   : 7
    <94f>   DW_AT_decl_line   : 135
    <950>   DW_AT_decl_column : 3
    <951>   DW_AT_type        : <0x90d>
 <1><955>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <956>   DW_AT_type        : <0x949>
 <1><95a>: Abbrev Number: 2 (DW_TAG_typedef)
    <95b>   DW_AT_name        : (indirect string, offset: 0x874e6): HAL_UART_RxTypeTypeDef
    <95f>   DW_AT_decl_file   : 7
    <960>   DW_AT_decl_line   : 144
    <961>   DW_AT_decl_column : 18
    <962>   DW_AT_type        : <0x60d>
 <1><966>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <967>   DW_AT_type        : <0x95a>
 <1><96b>: Abbrev Number: 2 (DW_TAG_typedef)
    <96c>   DW_AT_name        : (indirect string, offset: 0x873f3): HAL_UART_RxEventTypeTypeDef
    <970>   DW_AT_decl_file   : 7
    <971>   DW_AT_decl_line   : 155
    <972>   DW_AT_decl_column : 18
    <973>   DW_AT_type        : <0x60d>
 <1><977>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <978>   DW_AT_type        : <0x96b>
 <1><97c>: Abbrev Number: 15 (DW_TAG_structure_type)
    <97d>   DW_AT_name        : (indirect string, offset: 0x875b5): __UART_HandleTypeDef
    <981>   DW_AT_byte_size   : 72
    <982>   DW_AT_decl_file   : 7
    <983>   DW_AT_decl_line   : 160
    <984>   DW_AT_decl_column : 16
    <984>   DW_AT_sibling     : <0xa59>
 <2><988>: Abbrev Number: 1 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x874d6): Instance
    <98d>   DW_AT_decl_file   : 7
    <98e>   DW_AT_decl_line   : 162
    <98f>   DW_AT_decl_column : 34
    <990>   DW_AT_type        : <0xa59>
    <994>   DW_AT_data_member_location: 0
 <2><995>: Abbrev Number: 1 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x8e83a): Init
    <99a>   DW_AT_decl_file   : 7
    <99b>   DW_AT_decl_line   : 164
    <99c>   DW_AT_decl_column : 33
    <99d>   DW_AT_type        : <0x901>
    <9a1>   DW_AT_data_member_location: 4
 <2><9a2>: Abbrev Number: 1 (DW_TAG_member)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x87559): pTxBuffPtr
    <9a7>   DW_AT_decl_file   : 7
    <9a8>   DW_AT_decl_line   : 166
    <9a9>   DW_AT_decl_column : 34
    <9aa>   DW_AT_type        : <0xa5e>
    <9ae>   DW_AT_data_member_location: 32
 <2><9af>: Abbrev Number: 1 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x874fd): TxXferSize
    <9b4>   DW_AT_decl_file   : 7
    <9b5>   DW_AT_decl_line   : 168
    <9b6>   DW_AT_decl_column : 33
    <9b7>   DW_AT_type        : <0x5fc>
    <9bb>   DW_AT_data_member_location: 36
 <2><9bc>: Abbrev Number: 1 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x87564): TxXferCount
    <9c1>   DW_AT_decl_file   : 7
    <9c2>   DW_AT_decl_line   : 170
    <9c3>   DW_AT_decl_column : 33
    <9c4>   DW_AT_type        : <0x608>
    <9c8>   DW_AT_data_member_location: 38
 <2><9c9>: Abbrev Number: 1 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x8771d): pRxBuffPtr
    <9ce>   DW_AT_decl_file   : 7
    <9cf>   DW_AT_decl_line   : 172
    <9d0>   DW_AT_decl_column : 34
    <9d1>   DW_AT_type        : <0xa63>
    <9d5>   DW_AT_data_member_location: 40
 <2><9d6>: Abbrev Number: 1 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x8754e): RxXferSize
    <9db>   DW_AT_decl_file   : 7
    <9dc>   DW_AT_decl_line   : 174
    <9dd>   DW_AT_decl_column : 33
    <9de>   DW_AT_type        : <0x5fc>
    <9e2>   DW_AT_data_member_location: 44
 <2><9e3>: Abbrev Number: 1 (DW_TAG_member)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x875da): RxXferCount
    <9e8>   DW_AT_decl_file   : 7
    <9e9>   DW_AT_decl_line   : 176
    <9ea>   DW_AT_decl_column : 33
    <9eb>   DW_AT_type        : <0x608>
    <9ef>   DW_AT_data_member_location: 46
 <2><9f0>: Abbrev Number: 1 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x8769d): ReceptionType
    <9f5>   DW_AT_decl_file   : 7
    <9f6>   DW_AT_decl_line   : 178
    <9f7>   DW_AT_decl_column : 31
    <9f8>   DW_AT_type        : <0x966>
    <9fc>   DW_AT_data_member_location: 48
 <2><9fd>: Abbrev Number: 1 (DW_TAG_member)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x8f8f3): RxEventType
    <a02>   DW_AT_decl_file   : 7
    <a03>   DW_AT_decl_line   : 180
    <a04>   DW_AT_decl_column : 36
    <a05>   DW_AT_type        : <0x977>
    <a09>   DW_AT_data_member_location: 52
 <2><a0a>: Abbrev Number: 1 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x8774d): hdmatx
    <a0f>   DW_AT_decl_file   : 7
    <a10>   DW_AT_decl_line   : 182
    <a11>   DW_AT_decl_column : 34
    <a12>   DW_AT_type        : <0x899>
    <a16>   DW_AT_data_member_location: 56
 <2><a17>: Abbrev Number: 1 (DW_TAG_member)
    <a18>   DW_AT_name        : (indirect string, offset: 0x87746): hdmarx
    <a1c>   DW_AT_decl_file   : 7
    <a1d>   DW_AT_decl_line   : 184
    <a1e>   DW_AT_decl_column : 34
    <a1f>   DW_AT_type        : <0x899>
    <a23>   DW_AT_data_member_location: 60
 <2><a24>: Abbrev Number: 1 (DW_TAG_member)
    <a25>   DW_AT_name        : (indirect string, offset: 0x60b0c): Lock
    <a29>   DW_AT_decl_file   : 7
    <a2a>   DW_AT_decl_line   : 186
    <a2b>   DW_AT_decl_column : 33
    <a2c>   DW_AT_type        : <0x713>
    <a30>   DW_AT_data_member_location: 64
 <2><a31>: Abbrev Number: 1 (DW_TAG_member)
    <a32>   DW_AT_name        : (indirect string, offset: 0x874df): gState
    <a36>   DW_AT_decl_file   : 7
    <a37>   DW_AT_decl_line   : 188
    <a38>   DW_AT_decl_column : 33
    <a39>   DW_AT_type        : <0x955>
    <a3d>   DW_AT_data_member_location: 65
 <2><a3e>: Abbrev Number: 1 (DW_TAG_member)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x876de): RxState
    <a43>   DW_AT_decl_file   : 7
    <a44>   DW_AT_decl_line   : 192
    <a45>   DW_AT_decl_column : 33
    <a46>   DW_AT_type        : <0x955>
    <a4a>   DW_AT_data_member_location: 66
 <2><a4b>: Abbrev Number: 1 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x87754): ErrorCode
    <a50>   DW_AT_decl_file   : 7
    <a51>   DW_AT_decl_line   : 195
    <a52>   DW_AT_decl_column : 33
    <a53>   DW_AT_type        : <0x619>
    <a57>   DW_AT_data_member_location: 68
 <2><a58>: Abbrev Number: 0
 <1><a59>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a5a>   DW_AT_byte_size   : 4
    <a5a>   DW_AT_type        : <0x6e9>
 <1><a5e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a5f>   DW_AT_byte_size   : 4
    <a5f>   DW_AT_type        : <0x5f7>
 <1><a63>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a64>   DW_AT_byte_size   : 4
    <a64>   DW_AT_type        : <0x5eb>
 <1><a68>: Abbrev Number: 2 (DW_TAG_typedef)
    <a69>   DW_AT_name        : (indirect string, offset: 0x875b7): UART_HandleTypeDef
    <a6d>   DW_AT_decl_file   : 7
    <a6e>   DW_AT_decl_line   : 213
    <a6f>   DW_AT_decl_column : 3
    <a70>   DW_AT_type        : <0x97c>
 <1><a74>: Abbrev Number: 4 (DW_TAG_base_type)
    <a75>   DW_AT_byte_size   : 1
    <a76>   DW_AT_encoding    : 8	(unsigned char)
    <a77>   DW_AT_name        : (indirect string, offset: 0x89731): char
 <1><a7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x43a6b): int8
    <a80>   DW_AT_decl_file   : 8
    <a81>   DW_AT_decl_line   : 23
    <a82>   DW_AT_decl_column : 33
    <a83>   DW_AT_type        : <0xa74>
 <1><a87>: Abbrev Number: 2 (DW_TAG_typedef)
    <a88>   DW_AT_name        : (indirect string, offset: 0x7e1bf): uint16
    <a8c>   DW_AT_decl_file   : 8
    <a8d>   DW_AT_decl_line   : 26
    <a8e>   DW_AT_decl_column : 33
    <a8f>   DW_AT_type        : <0x5ae>
 <1><a93>: Abbrev Number: 2 (DW_TAG_typedef)
    <a94>   DW_AT_name        : (indirect string, offset: 0x7e986): uint32
    <a98>   DW_AT_decl_file   : 8
    <a99>   DW_AT_decl_line   : 28
    <a9a>   DW_AT_decl_column : 33
    <a9b>   DW_AT_type        : <0x5e4>
 <1><a9f>: Abbrev Number: 23 (DW_TAG_variable)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x8752c): stUart2
    <aa4>   DW_AT_decl_file   : 1
    <aa5>   DW_AT_decl_line   : 22
    <aa6>   DW_AT_decl_column : 20
    <aa7>   DW_AT_type        : <0xa68>
    <aab>   DW_AT_external    : 1
    <aab>   DW_AT_location    : 5 byte block: 3 dc 0 0 20 	(DW_OP_addr: 200000dc)
 <1><ab1>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ab2>   DW_AT_external    : 1
    <ab2>   DW_AT_name        : (indirect string, offset: 0x875f8): uartTransfer
    <ab6>   DW_AT_decl_file   : 9
    <ab6>   DW_AT_decl_line   : 29
    <ab7>   DW_AT_decl_column : 6
    <ab7>   DW_AT_prototyped  : 1
    <ab7>   DW_AT_type        : <0xad4>
    <abb>   DW_AT_declaration : 1
    <abb>   DW_AT_sibling     : <0xad4>
 <2><abf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ac0>   DW_AT_type        : <0xadb>
 <2><ac4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ac5>   DW_AT_type        : <0xae0>
 <2><ac9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <aca>   DW_AT_type        : <0xa87>
 <2><ace>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <acf>   DW_AT_type        : <0xa93>
 <2><ad3>: Abbrev Number: 0
 <1><ad4>: Abbrev Number: 4 (DW_TAG_base_type)
    <ad5>   DW_AT_byte_size   : 1
    <ad6>   DW_AT_encoding    : 2	(boolean)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x44759): _Bool
 <1><adb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <adc>   DW_AT_byte_size   : 4
    <adc>   DW_AT_type        : <0xa68>
 <1><ae0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ae1>   DW_AT_byte_size   : 4
    <ae1>   DW_AT_type        : <0xa7b>
 <1><ae5>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ae6>   DW_AT_external    : 1
    <ae6>   DW_AT_name        : (indirect string, offset: 0x876d5): uartInit
    <aea>   DW_AT_decl_file   : 9
    <aea>   DW_AT_decl_line   : 28
    <aeb>   DW_AT_decl_column : 6
    <aeb>   DW_AT_prototyped  : 1
    <aeb>   DW_AT_type        : <0xad4>
    <aef>   DW_AT_declaration : 1
    <aef>   DW_AT_sibling     : <0xaf9>
 <2><af3>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <af4>   DW_AT_type        : <0xadb>
 <2><af8>: Abbrev Number: 0
 <1><af9>: Abbrev Number: 24 (DW_TAG_subprogram)
    <afa>   DW_AT_external    : 1
    <afa>   DW_AT_name        : (indirect string, offset: 0x6f4e0): consoleSerialPrint
    <afe>   DW_AT_decl_file   : 1
    <aff>   DW_AT_decl_line   : 63
    <b00>   DW_AT_decl_column : 6
    <b01>   DW_AT_prototyped  : 1
    <b01>   DW_AT_type        : <0xad4>
    <b05>   DW_AT_low_pc      : 0x80003a8
    <b09>   DW_AT_high_pc     : 0x44
    <b0d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b0f>   DW_AT_call_all_tail_calls: 1
    <b0f>   DW_AT_sibling     : <0xb48>
 <2><b13>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <b14>   DW_AT_name        : (indirect string, offset: 0x87653): pcInputData
    <b18>   DW_AT_decl_file   : 1
    <b18>   DW_AT_decl_line   : 63
    <b18>   DW_AT_decl_column : 31
    <b19>   DW_AT_type        : <0xae0>
    <b1d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b20>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <b21>   DW_AT_name        : (indirect string, offset: 0x87493): unDataLen
    <b25>   DW_AT_decl_file   : 1
    <b25>   DW_AT_decl_line   : 63
    <b25>   DW_AT_decl_column : 51
    <b26>   DW_AT_type        : <0xa87>
    <b2a>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><b2d>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x87693): ulTimeout
    <b32>   DW_AT_decl_file   : 1
    <b32>   DW_AT_decl_line   : 63
    <b32>   DW_AT_decl_column : 69
    <b33>   DW_AT_type        : <0xa93>
    <b37>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b3a>: Abbrev Number: 17 (DW_TAG_variable)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x876b8): blReturn
    <b3f>   DW_AT_decl_file   : 1
    <b3f>   DW_AT_decl_line   : 65
    <b40>   DW_AT_decl_column : 7
    <b40>   DW_AT_type        : <0xad4>
    <b44>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b47>: Abbrev Number: 0
 <1><b48>: Abbrev Number: 25 (DW_TAG_subprogram)
    <b49>   DW_AT_external    : 1
    <b49>   DW_AT_name        : (indirect string, offset: 0x875e6): consoleSerialInit
    <b4d>   DW_AT_decl_file   : 1
    <b4e>   DW_AT_decl_line   : 33
    <b4f>   DW_AT_decl_column : 6
    <b50>   DW_AT_type        : <0xad4>
    <b54>   DW_AT_low_pc      : 0x8000348
    <b58>   DW_AT_high_pc     : 0x60
    <b5c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b5e>   DW_AT_call_all_tail_calls: 1
 <2><b5e>: Abbrev Number: 17 (DW_TAG_variable)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x876b8): blReturn
    <b63>   DW_AT_decl_file   : 1
    <b63>   DW_AT_decl_line   : 35
    <b64>   DW_AT_decl_column : 7
    <b64>   DW_AT_type        : <0xad4>
    <b68>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b6b>: Abbrev Number: 0
 <1><b6c>: Abbrev Number: 0
  Compilation Unit @ offset 0xb6d:
   Length:        0x5f1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x321
   Pointer Size:  4
 <0><b79>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <b7a>   DW_AT_producer    : (indirect string, offset: 0x86d05): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b7e>   DW_AT_language    : 29	(C11)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x878f0): ../Core/GPIO/GPIO.c
    <b83>   DW_AT_comp_dir    : (indirect string, offset: 0x7bd3a): F:/WorkSpace/stmDemoApp/Debug
    <b87>   DW_AT_ranges      : 0x39
    <b8b>   DW_AT_low_pc      : 0
    <b8f>   DW_AT_stmt_list   : 0x1488
    <b93>   DW_AT_macros      : 0x16ac4
 <1><b97>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <b98>   DW_AT_encoding    : 5	(signed)
    <b99>   DW_AT_byte_size   : 1
    <b99>   DW_AT_type        : <0xcdc>
    <b9d>   DW_AT_decl_file   : 2
    <b9e>   DW_AT_decl_line   : 69
    <b9f>   DW_AT_decl_column : 1
    <b9f>   DW_AT_sibling     : <0xcdc>
 <2><ba3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x8786c): NonMaskableInt_IRQn
    <ba8>   DW_AT_const_value : -14
 <2><ba9>: Abbrev Number: 5 (DW_TAG_enumerator)
    <baa>   DW_AT_name        : (indirect string, offset: 0x877db): HardFault_IRQn
    <bae>   DW_AT_const_value : -13
 <2><baf>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x87982): MemoryManagement_IRQn
    <bb4>   DW_AT_const_value : -12
 <2><bb5>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x87ab6): BusFault_IRQn
    <bba>   DW_AT_const_value : -11
 <2><bbb>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x87a1c): UsageFault_IRQn
    <bc0>   DW_AT_const_value : -10
 <2><bc1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x877a5): SVCall_IRQn
    <bc6>   DW_AT_const_value : -5
 <2><bc7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x87998): DebugMonitor_IRQn
    <bcc>   DW_AT_const_value : -4
 <2><bcd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bce>   DW_AT_name        : (indirect string, offset: 0x879c3): PendSV_IRQn
    <bd2>   DW_AT_const_value : -2
 <2><bd3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x87aeb): SysTick_IRQn
    <bd8>   DW_AT_const_value : -1
 <2><bd9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bda>   DW_AT_name        : (indirect string, offset: 0x87a48): WWDG_IRQn
    <bde>   DW_AT_const_value : 0
 <2><bdf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be0>   DW_AT_name        : (indirect string, offset: 0x87863): PVD_IRQn
    <be4>   DW_AT_const_value : 1
 <2><be5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be6>   DW_AT_name        : (indirect string, offset: 0x8790e): TAMPER_IRQn
    <bea>   DW_AT_const_value : 2
 <2><beb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bec>   DW_AT_name        : (indirect string, offset: 0x879b5): RTC_IRQn
    <bf0>   DW_AT_const_value : 3
 <2><bf1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x878ae): FLASH_IRQn
    <bf6>   DW_AT_const_value : 4
 <2><bf7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x87aad): RCC_IRQn
    <bfc>   DW_AT_const_value : 5
 <2><bfd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x879aa): EXTI0_IRQn
    <c02>   DW_AT_const_value : 6
 <2><c03>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c04>   DW_AT_name        : (indirect string, offset: 0x87b81): EXTI1_IRQn
    <c08>   DW_AT_const_value : 7
 <2><c09>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x87941): EXTI2_IRQn
    <c0e>   DW_AT_const_value : 8
 <2><c0f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c10>   DW_AT_name        : (indirect string, offset: 0x87af8): EXTI3_IRQn
    <c14>   DW_AT_const_value : 9
 <2><c15>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c16>   DW_AT_name        : (indirect string, offset: 0x87853): EXTI4_IRQn
    <c1a>   DW_AT_const_value : 10
 <2><c1b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x878ca): DMA1_Channel1_IRQn
    <c20>   DW_AT_const_value : 11
 <2><c21>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c22>   DW_AT_name        : (indirect string, offset: 0x87a6f): DMA1_Channel2_IRQn
    <c26>   DW_AT_const_value : 12
 <2><c27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c28>   DW_AT_name        : (indirect string, offset: 0x8782d): DMA1_Channel3_IRQn
    <c2c>   DW_AT_const_value : 13
 <2><c2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x879e3): DMA1_Channel4_IRQn
    <c32>   DW_AT_const_value : 14
 <2><c33>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c34>   DW_AT_name        : (indirect string, offset: 0x877b1): DMA1_Channel5_IRQn
    <c38>   DW_AT_const_value : 15
 <2><c39>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x87955): DMA1_Channel6_IRQn
    <c3e>   DW_AT_const_value : 16
 <2><c3f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c40>   DW_AT_name        : (indirect string, offset: 0x87b50): DMA1_Channel7_IRQn
    <c44>   DW_AT_const_value : 17
 <2><c45>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c46>   DW_AT_name        : (indirect string, offset: 0x47b49): ADC1_2_IRQn
    <c4a>   DW_AT_const_value : 18
 <2><c4b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x3bbac): USB_HP_CAN1_TX_IRQn
    <c50>   DW_AT_const_value : 19
 <2><c51>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c52>   DW_AT_name        : (indirect string, offset: 0x81c8c): USB_LP_CAN1_RX0_IRQn
    <c56>   DW_AT_const_value : 20
 <2><c57>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c58>   DW_AT_name        : (indirect string, offset: 0x87a3a): CAN1_RX1_IRQn
    <c5c>   DW_AT_const_value : 21
 <2><c5d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x87a2c): CAN1_SCE_IRQn
    <c62>   DW_AT_const_value : 22
 <2><c63>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c64>   DW_AT_name        : (indirect string, offset: 0x87b63): EXTI9_5_IRQn
    <c68>   DW_AT_const_value : 23
 <2><c69>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x254e0): TIM1_BRK_IRQn
    <c6e>   DW_AT_const_value : 24
 <2><c6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c70>   DW_AT_name        : (indirect string, offset: 0x501c3): TIM1_UP_IRQn
    <c74>   DW_AT_const_value : 25
 <2><c75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c76>   DW_AT_name        : (indirect string, offset: 0x2b6ff): TIM1_TRG_COM_IRQn
    <c7a>   DW_AT_const_value : 26
 <2><c7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x87aa0): TIM1_CC_IRQn
    <c80>   DW_AT_const_value : 27
 <2><c81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c82>   DW_AT_name        : (indirect string, offset: 0x8781b): TIM2_IRQn
    <c86>   DW_AT_const_value : 28
 <2><c87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c88>   DW_AT_name        : (indirect string, offset: 0x879d9): TIM3_IRQn
    <c8c>   DW_AT_const_value : 29
 <2><c8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x87904): TIM4_IRQn
    <c92>   DW_AT_const_value : 30
 <2><c93>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c94>   DW_AT_name        : (indirect string, offset: 0x8791a): I2C1_EV_IRQn
    <c98>   DW_AT_const_value : 31
 <2><c99>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x87a0f): I2C1_ER_IRQn
    <c9e>   DW_AT_const_value : 32
 <2><c9f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x877fb): I2C2_EV_IRQn
    <ca4>   DW_AT_const_value : 33
 <2><ca5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x87934): I2C2_ER_IRQn
    <caa>   DW_AT_const_value : 34
 <2><cab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cac>   DW_AT_name        : (indirect string, offset: 0x87808): SPI1_IRQn
    <cb0>   DW_AT_const_value : 35
 <2><cb1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x879cf): SPI2_IRQn
    <cb6>   DW_AT_const_value : 36
 <2><cb7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x87ac4): USART1_IRQn
    <cbc>   DW_AT_const_value : 37
 <2><cbd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x878be): USART2_IRQn
    <cc2>   DW_AT_const_value : 38
 <2><cc3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x87a52): USART3_IRQn
    <cc8>   DW_AT_const_value : 39
 <2><cc9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cca>   DW_AT_name        : (indirect string, offset: 0x2e827): EXTI15_10_IRQn
    <cce>   DW_AT_const_value : 40
 <2><ccf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x87b32): RTC_Alarm_IRQn
    <cd4>   DW_AT_const_value : 41
 <2><cd5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cd6>   DW_AT_name        : (indirect string, offset: 0x8241a): USBWakeUp_IRQn
    <cda>   DW_AT_const_value : 42
 <2><cdb>: Abbrev Number: 0
 <1><cdc>: Abbrev Number: 3 (DW_TAG_base_type)
    <cdd>   DW_AT_byte_size   : 1
    <cde>   DW_AT_encoding    : 6	(signed char)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x43ac5): signed char
 <1><ce3>: Abbrev Number: 7 (DW_TAG_typedef)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x87b46): IRQn_Type
    <ce8>   DW_AT_decl_file   : 2
    <ce9>   DW_AT_decl_line   : 125
    <cea>   DW_AT_decl_column : 3
    <ceb>   DW_AT_type        : <0xb97>
 <1><cef>: Abbrev Number: 3 (DW_TAG_base_type)
    <cf0>   DW_AT_byte_size   : 1
    <cf1>   DW_AT_encoding    : 8	(unsigned char)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x1b3be): unsigned char
 <1><cf6>: Abbrev Number: 3 (DW_TAG_base_type)
    <cf7>   DW_AT_byte_size   : 2
    <cf8>   DW_AT_encoding    : 5	(signed)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x64f0a): short int
 <1><cfd>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x87688): __uint16_t
    <d02>   DW_AT_decl_file   : 3
    <d03>   DW_AT_decl_line   : 57
    <d04>   DW_AT_decl_column : 25
    <d05>   DW_AT_type        : <0xd09>
 <1><d09>: Abbrev Number: 3 (DW_TAG_base_type)
    <d0a>   DW_AT_byte_size   : 2
    <d0b>   DW_AT_encoding    : 7	(unsigned)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x2c27c): short unsigned int
 <1><d10>: Abbrev Number: 3 (DW_TAG_base_type)
    <d11>   DW_AT_byte_size   : 4
    <d12>   DW_AT_encoding    : 5	(signed)
    <d13>   DW_AT_name        : (indirect string, offset: 0xbe94): long int
 <1><d17>: Abbrev Number: 7 (DW_TAG_typedef)
    <d18>   DW_AT_name        : (indirect string, offset: 0x560aa): __uint32_t
    <d1c>   DW_AT_decl_file   : 3
    <d1d>   DW_AT_decl_line   : 79
    <d1e>   DW_AT_decl_column : 25
    <d1f>   DW_AT_type        : <0xd23>
 <1><d23>: Abbrev Number: 3 (DW_TAG_base_type)
    <d24>   DW_AT_byte_size   : 4
    <d25>   DW_AT_encoding    : 7	(unsigned)
    <d26>   DW_AT_name        : (indirect string, offset: 0x1faf8): long unsigned int
 <1><d2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <d2b>   DW_AT_byte_size   : 8
    <d2c>   DW_AT_encoding    : 5	(signed)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x3e0a1): long long int
 <1><d31>: Abbrev Number: 3 (DW_TAG_base_type)
    <d32>   DW_AT_byte_size   : 8
    <d33>   DW_AT_encoding    : 7	(unsigned)
    <d34>   DW_AT_name        : (indirect string, offset: 0x1bcc1): long long unsigned int
 <1><d38>: Abbrev Number: 21 (DW_TAG_base_type)
    <d39>   DW_AT_byte_size   : 4
    <d3a>   DW_AT_encoding    : 5	(signed)
    <d3b>   DW_AT_name        : int
 <1><d3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <d40>   DW_AT_byte_size   : 4
    <d41>   DW_AT_encoding    : 7	(unsigned)
    <d42>   DW_AT_name        : (indirect string, offset: 0xb844): unsigned int
 <1><d46>: Abbrev Number: 7 (DW_TAG_typedef)
    <d47>   DW_AT_name        : (indirect string, offset: 0x8b53b): uint16_t
    <d4b>   DW_AT_decl_file   : 4
    <d4c>   DW_AT_decl_line   : 36
    <d4d>   DW_AT_decl_column : 20
    <d4e>   DW_AT_type        : <0xcfd>
 <1><d52>: Abbrev Number: 7 (DW_TAG_typedef)
    <d53>   DW_AT_name        : (indirect string, offset: 0x8b500): uint32_t
    <d57>   DW_AT_decl_file   : 4
    <d58>   DW_AT_decl_line   : 48
    <d59>   DW_AT_decl_column : 20
    <d5a>   DW_AT_type        : <0xd17>
 <1><d5e>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <d5f>   DW_AT_type        : <0xd52>
 <1><d63>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d64>   DW_AT_byte_size   : 28
    <d65>   DW_AT_decl_file   : 2
    <d65>   DW_AT_decl_line   : 357
    <d67>   DW_AT_decl_column : 9
    <d67>   DW_AT_sibling     : <0xdc0>
 <2><d6b>: Abbrev Number: 8 (DW_TAG_member)
    <d6c>   DW_AT_name        : CRL
    <d70>   DW_AT_decl_file   : 2
    <d70>   DW_AT_decl_line   : 359
    <d72>   DW_AT_decl_column : 17
    <d72>   DW_AT_type        : <0xd5e>
    <d76>   DW_AT_data_member_location: 0
 <2><d77>: Abbrev Number: 8 (DW_TAG_member)
    <d78>   DW_AT_name        : CRH
    <d7c>   DW_AT_decl_file   : 2
    <d7c>   DW_AT_decl_line   : 360
    <d7e>   DW_AT_decl_column : 17
    <d7e>   DW_AT_type        : <0xd5e>
    <d82>   DW_AT_data_member_location: 4
 <2><d83>: Abbrev Number: 8 (DW_TAG_member)
    <d84>   DW_AT_name        : IDR
    <d88>   DW_AT_decl_file   : 2
    <d88>   DW_AT_decl_line   : 361
    <d8a>   DW_AT_decl_column : 17
    <d8a>   DW_AT_type        : <0xd5e>
    <d8e>   DW_AT_data_member_location: 8
 <2><d8f>: Abbrev Number: 8 (DW_TAG_member)
    <d90>   DW_AT_name        : ODR
    <d94>   DW_AT_decl_file   : 2
    <d94>   DW_AT_decl_line   : 362
    <d96>   DW_AT_decl_column : 17
    <d96>   DW_AT_type        : <0xd5e>
    <d9a>   DW_AT_data_member_location: 12
 <2><d9b>: Abbrev Number: 6 (DW_TAG_member)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x878b9): BSRR
    <da0>   DW_AT_decl_file   : 2
    <da0>   DW_AT_decl_line   : 363
    <da2>   DW_AT_decl_column : 17
    <da2>   DW_AT_type        : <0xd5e>
    <da6>   DW_AT_data_member_location: 16
 <2><da7>: Abbrev Number: 8 (DW_TAG_member)
    <da8>   DW_AT_name        : BRR
    <dac>   DW_AT_decl_file   : 2
    <dac>   DW_AT_decl_line   : 364
    <dae>   DW_AT_decl_column : 17
    <dae>   DW_AT_type        : <0xd5e>
    <db2>   DW_AT_data_member_location: 20
 <2><db3>: Abbrev Number: 6 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x87b41): LCKR
    <db8>   DW_AT_decl_file   : 2
    <db8>   DW_AT_decl_line   : 365
    <dba>   DW_AT_decl_column : 17
    <dba>   DW_AT_type        : <0xd5e>
    <dbe>   DW_AT_data_member_location: 24
 <2><dbf>: Abbrev Number: 0
 <1><dc0>: Abbrev Number: 17 (DW_TAG_typedef)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x87b8c): GPIO_TypeDef
    <dc5>   DW_AT_decl_file   : 2
    <dc5>   DW_AT_decl_line   : 366
    <dc7>   DW_AT_decl_column : 3
    <dc7>   DW_AT_type        : <0xd63>
 <1><dcb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <dcc>   DW_AT_byte_size   : 40
    <dcd>   DW_AT_decl_file   : 2
    <dcd>   DW_AT_decl_line   : 423
    <dcf>   DW_AT_decl_column : 9
    <dcf>   DW_AT_sibling     : <0xe4b>
 <2><dd3>: Abbrev Number: 8 (DW_TAG_member)
    <dd4>   DW_AT_name        : CR
    <dd7>   DW_AT_decl_file   : 2
    <dd7>   DW_AT_decl_line   : 425
    <dd9>   DW_AT_decl_column : 17
    <dd9>   DW_AT_type        : <0xd5e>
    <ddd>   DW_AT_data_member_location: 0
 <2><dde>: Abbrev Number: 6 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x879fc): CFGR
    <de3>   DW_AT_decl_file   : 2
    <de3>   DW_AT_decl_line   : 426
    <de5>   DW_AT_decl_column : 17
    <de5>   DW_AT_type        : <0xd5e>
    <de9>   DW_AT_data_member_location: 4
 <2><dea>: Abbrev Number: 8 (DW_TAG_member)
    <deb>   DW_AT_name        : CIR
    <def>   DW_AT_decl_file   : 2
    <def>   DW_AT_decl_line   : 427
    <df1>   DW_AT_decl_column : 17
    <df1>   DW_AT_type        : <0xd5e>
    <df5>   DW_AT_data_member_location: 8
 <2><df6>: Abbrev Number: 6 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x8794c): APB2RSTR
    <dfb>   DW_AT_decl_file   : 2
    <dfb>   DW_AT_decl_line   : 428
    <dfd>   DW_AT_decl_column : 17
    <dfd>   DW_AT_type        : <0xd5e>
    <e01>   DW_AT_data_member_location: 12
 <2><e02>: Abbrev Number: 6 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x87812): APB1RSTR
    <e07>   DW_AT_decl_file   : 2
    <e07>   DW_AT_decl_line   : 429
    <e09>   DW_AT_decl_column : 17
    <e09>   DW_AT_type        : <0xd5e>
    <e0d>   DW_AT_data_member_location: 16
 <2><e0e>: Abbrev Number: 6 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x877c4): AHBENR
    <e13>   DW_AT_decl_file   : 2
    <e13>   DW_AT_decl_line   : 430
    <e15>   DW_AT_decl_column : 17
    <e15>   DW_AT_type        : <0xd5e>
    <e19>   DW_AT_data_member_location: 20
 <2><e1a>: Abbrev Number: 6 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x87825): APB2ENR
    <e1f>   DW_AT_decl_file   : 2
    <e1f>   DW_AT_decl_line   : 431
    <e21>   DW_AT_decl_column : 17
    <e21>   DW_AT_type        : <0xd5e>
    <e25>   DW_AT_data_member_location: 24
 <2><e26>: Abbrev Number: 6 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0x87a98): APB1ENR
    <e2b>   DW_AT_decl_file   : 2
    <e2b>   DW_AT_decl_line   : 432
    <e2d>   DW_AT_decl_column : 17
    <e2d>   DW_AT_type        : <0xd5e>
    <e31>   DW_AT_data_member_location: 28
 <2><e32>: Abbrev Number: 6 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0x8785e): BDCR
    <e37>   DW_AT_decl_file   : 2
    <e37>   DW_AT_decl_line   : 433
    <e39>   DW_AT_decl_column : 17
    <e39>   DW_AT_type        : <0xd5e>
    <e3d>   DW_AT_data_member_location: 32
 <2><e3e>: Abbrev Number: 8 (DW_TAG_member)
    <e3f>   DW_AT_name        : CSR
    <e43>   DW_AT_decl_file   : 2
    <e43>   DW_AT_decl_line   : 434
    <e45>   DW_AT_decl_column : 17
    <e45>   DW_AT_type        : <0xd5e>
    <e49>   DW_AT_data_member_location: 36
 <2><e4a>: Abbrev Number: 0
 <1><e4b>: Abbrev Number: 17 (DW_TAG_typedef)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x87976): RCC_TypeDef
    <e50>   DW_AT_decl_file   : 2
    <e50>   DW_AT_decl_line   : 437
    <e52>   DW_AT_decl_column : 3
    <e52>   DW_AT_type        : <0xdcb>
 <1><e56>: Abbrev Number: 3 (DW_TAG_base_type)
    <e57>   DW_AT_byte_size   : 8
    <e58>   DW_AT_encoding    : 4	(float)
    <e59>   DW_AT_name        : (indirect string, offset: 0xcf6f): long double
 <1><e5d>: Abbrev Number: 23 (DW_TAG_structure_type)
    <e5e>   DW_AT_byte_size   : 16
    <e5f>   DW_AT_decl_file   : 5
    <e60>   DW_AT_decl_line   : 46
    <e61>   DW_AT_decl_column : 9
    <e62>   DW_AT_sibling     : <0xe95>
 <2><e66>: Abbrev Number: 24 (DW_TAG_member)
    <e67>   DW_AT_name        : Pin
    <e6b>   DW_AT_decl_file   : 5
    <e6c>   DW_AT_decl_line   : 48
    <e6d>   DW_AT_decl_column : 12
    <e6e>   DW_AT_type        : <0xd52>
    <e72>   DW_AT_data_member_location: 0
 <2><e73>: Abbrev Number: 11 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x8ea53): Mode
    <e78>   DW_AT_decl_file   : 5
    <e78>   DW_AT_decl_line   : 51
    <e79>   DW_AT_decl_column : 12
    <e79>   DW_AT_type        : <0xd52>
    <e7d>   DW_AT_data_member_location: 4
 <2><e7e>: Abbrev Number: 11 (DW_TAG_member)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x879be): Pull
    <e83>   DW_AT_decl_file   : 5
    <e83>   DW_AT_decl_line   : 54
    <e84>   DW_AT_decl_column : 12
    <e84>   DW_AT_type        : <0xd52>
    <e88>   DW_AT_data_member_location: 8
 <2><e89>: Abbrev Number: 11 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x879f6): Speed
    <e8e>   DW_AT_decl_file   : 5
    <e8e>   DW_AT_decl_line   : 57
    <e8f>   DW_AT_decl_column : 12
    <e8f>   DW_AT_type        : <0xd52>
    <e93>   DW_AT_data_member_location: 12
 <2><e94>: Abbrev Number: 0
 <1><e95>: Abbrev Number: 7 (DW_TAG_typedef)
    <e96>   DW_AT_name        : (indirect string, offset: 0x87b70): GPIO_InitTypeDef
    <e9a>   DW_AT_decl_file   : 5
    <e9b>   DW_AT_decl_line   : 59
    <e9c>   DW_AT_decl_column : 3
    <e9d>   DW_AT_type        : <0xe5d>
 <1><ea1>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <ea2>   DW_AT_encoding    : 7	(unsigned)
    <ea3>   DW_AT_byte_size   : 1
    <ea3>   DW_AT_type        : <0xcef>
    <ea7>   DW_AT_decl_file   : 5
    <ea8>   DW_AT_decl_line   : 65
    <ea9>   DW_AT_decl_column : 1
    <ea9>   DW_AT_sibling     : <0xeba>
 <2><ead>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0x8789f): GPIO_PIN_RESET
    <eb2>   DW_AT_const_value : 0
 <2><eb3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x87880): GPIO_PIN_SET
    <eb8>   DW_AT_const_value : 1
 <2><eb9>: Abbrev Number: 0
 <1><eba>: Abbrev Number: 7 (DW_TAG_typedef)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x87b99): GPIO_PinState
    <ebf>   DW_AT_decl_file   : 5
    <ec0>   DW_AT_decl_line   : 68
    <ec1>   DW_AT_decl_column : 3
    <ec2>   DW_AT_type        : <0xea1>
 <1><ec6>: Abbrev Number: 3 (DW_TAG_base_type)
    <ec7>   DW_AT_byte_size   : 1
    <ec8>   DW_AT_encoding    : 8	(unsigned char)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x89731): char
 <1><ecd>: Abbrev Number: 7 (DW_TAG_typedef)
    <ece>   DW_AT_name        : (indirect string, offset: 0x7e1bf): uint16
    <ed2>   DW_AT_decl_file   : 6
    <ed3>   DW_AT_decl_line   : 26
    <ed4>   DW_AT_decl_column : 33
    <ed5>   DW_AT_type        : <0xd09>
 <1><ed9>: Abbrev Number: 25 (DW_TAG_subprogram)
    <eda>   DW_AT_external    : 1
    <eda>   DW_AT_name        : (indirect string, offset: 0x87a5e): HAL_GPIO_ReadPin
    <ede>   DW_AT_decl_file   : 5
    <edf>   DW_AT_decl_line   : 233
    <ee0>   DW_AT_decl_column : 15
    <ee1>   DW_AT_prototyped  : 1
    <ee1>   DW_AT_type        : <0xeba>
    <ee5>   DW_AT_declaration : 1
    <ee5>   DW_AT_sibling     : <0xef4>
 <2><ee9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <eea>   DW_AT_type        : <0xef4>
 <2><eee>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <eef>   DW_AT_type        : <0xd46>
 <2><ef3>: Abbrev Number: 0
 <1><ef4>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <ef5>   DW_AT_byte_size   : 4
    <ef5>   DW_AT_type        : <0xdc0>
 <1><ef9>: Abbrev Number: 12 (DW_TAG_subprogram)
    <efa>   DW_AT_external    : 1
    <efa>   DW_AT_name        : (indirect string, offset: 0x878dd): HAL_GPIO_TogglePin
    <efe>   DW_AT_decl_file   : 5
    <efe>   DW_AT_decl_line   : 235
    <eff>   DW_AT_decl_column : 6
    <f00>   DW_AT_prototyped  : 1
    <f00>   DW_AT_declaration : 1
    <f00>   DW_AT_sibling     : <0xf0f>
 <2><f04>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f05>   DW_AT_type        : <0xef4>
 <2><f09>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f0a>   DW_AT_type        : <0xd46>
 <2><f0e>: Abbrev Number: 0
 <1><f0f>: Abbrev Number: 12 (DW_TAG_subprogram)
    <f10>   DW_AT_external    : 1
    <f10>   DW_AT_name        : (indirect string, offset: 0x8788d): HAL_GPIO_WritePin
    <f14>   DW_AT_decl_file   : 5
    <f14>   DW_AT_decl_line   : 234
    <f15>   DW_AT_decl_column : 6
    <f16>   DW_AT_prototyped  : 1
    <f16>   DW_AT_declaration : 1
    <f16>   DW_AT_sibling     : <0xf2a>
 <2><f1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f1b>   DW_AT_type        : <0xef4>
 <2><f1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f20>   DW_AT_type        : <0xd46>
 <2><f24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f25>   DW_AT_type        : <0xeba>
 <2><f29>: Abbrev Number: 0
 <1><f2a>: Abbrev Number: 12 (DW_TAG_subprogram)
    <f2b>   DW_AT_external    : 1
    <f2b>   DW_AT_name        : (indirect string, offset: 0x87a01): HAL_GPIO_Init
    <f2f>   DW_AT_decl_file   : 5
    <f2f>   DW_AT_decl_line   : 223
    <f30>   DW_AT_decl_column : 7
    <f31>   DW_AT_prototyped  : 1
    <f31>   DW_AT_declaration : 1
    <f31>   DW_AT_sibling     : <0xf40>
 <2><f35>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f36>   DW_AT_type        : <0xef4>
 <2><f3a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f3b>   DW_AT_type        : <0xf40>
 <2><f3f>: Abbrev Number: 0
 <1><f40>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <f41>   DW_AT_byte_size   : 4
    <f41>   DW_AT_type        : <0xe95>
 <1><f45>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f46>   DW_AT_external    : 1
    <f46>   DW_AT_name        : (indirect string, offset: 0x87840): HAL_NVIC_EnableIRQ
    <f4a>   DW_AT_decl_file   : 7
    <f4a>   DW_AT_decl_line   : 263
    <f4c>   DW_AT_decl_column : 6
    <f4c>   DW_AT_prototyped  : 1
    <f4c>   DW_AT_declaration : 1
    <f4c>   DW_AT_sibling     : <0xf56>
 <2><f50>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f51>   DW_AT_type        : <0xce3>
 <2><f55>: Abbrev Number: 0
 <1><f56>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f57>   DW_AT_external    : 1
    <f57>   DW_AT_name        : (indirect string, offset: 0x87b14): HAL_NVIC_SetPriority
    <f5b>   DW_AT_decl_file   : 7
    <f5b>   DW_AT_decl_line   : 262
    <f5d>   DW_AT_decl_column : 6
    <f5d>   DW_AT_prototyped  : 1
    <f5d>   DW_AT_declaration : 1
    <f5d>   DW_AT_sibling     : <0xf71>
 <2><f61>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f62>   DW_AT_type        : <0xce3>
 <2><f66>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f67>   DW_AT_type        : <0xd52>
 <2><f6b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f6c>   DW_AT_type        : <0xd52>
 <2><f70>: Abbrev Number: 0
 <1><f71>: Abbrev Number: 26 (DW_TAG_subprogram)
    <f72>   DW_AT_external    : 1
    <f72>   DW_AT_name        : (indirect string, offset: 0x877ea): gpioGetPinStatus
    <f76>   DW_AT_decl_file   : 1
    <f77>   DW_AT_decl_line   : 146
    <f78>   DW_AT_decl_column : 6
    <f79>   DW_AT_prototyped  : 1
    <f79>   DW_AT_type        : <0xfb6>
    <f7d>   DW_AT_low_pc      : 0x800053e
    <f81>   DW_AT_high_pc     : 0x34
    <f85>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f87>   DW_AT_call_all_tail_calls: 1
    <f87>   DW_AT_sibling     : <0xfb6>
 <2><f8b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x87a82): pstGpioPort
    <f90>   DW_AT_decl_file   : 1
    <f90>   DW_AT_decl_line   : 146
    <f91>   DW_AT_decl_column : 37
    <f92>   DW_AT_type        : <0xef4>
    <f96>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f99>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x87a8e): unGpioPin
    <f9e>   DW_AT_decl_file   : 1
    <f9e>   DW_AT_decl_line   : 146
    <f9f>   DW_AT_decl_column : 57
    <fa0>   DW_AT_type        : <0xecd>
    <fa4>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><fa7>: Abbrev Number: 9 (DW_TAG_variable)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x876b8): blReturn
    <fac>   DW_AT_decl_file   : 1
    <fac>   DW_AT_decl_line   : 148
    <fad>   DW_AT_decl_column : 7
    <fae>   DW_AT_type        : <0xfb6>
    <fb2>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><fb5>: Abbrev Number: 0
 <1><fb6>: Abbrev Number: 3 (DW_TAG_base_type)
    <fb7>   DW_AT_byte_size   : 1
    <fb8>   DW_AT_encoding    : 2	(boolean)
    <fb9>   DW_AT_name        : (indirect string, offset: 0x44759): _Bool
 <1><fbd>: Abbrev Number: 10 (DW_TAG_subprogram)
    <fbe>   DW_AT_external    : 1
    <fbe>   DW_AT_name        : (indirect string, offset: 0x87968): gpioTogglePin
    <fc2>   DW_AT_decl_file   : 1
    <fc2>   DW_AT_decl_line   : 130
    <fc3>   DW_AT_decl_column : 6
    <fc3>   DW_AT_prototyped  : 1
    <fc3>   DW_AT_low_pc      : 0x800051a
    <fc7>   DW_AT_high_pc     : 0x24
    <fcb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fcd>   DW_AT_call_all_tail_calls: 1
    <fcd>   DW_AT_sibling     : <0xfee>
 <2><fd1>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x87a82): pstGpioPort
    <fd6>   DW_AT_decl_file   : 1
    <fd6>   DW_AT_decl_line   : 130
    <fd7>   DW_AT_decl_column : 34
    <fd8>   DW_AT_type        : <0xef4>
    <fdc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fdf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x87a8e): unGpioPin
    <fe4>   DW_AT_decl_file   : 1
    <fe4>   DW_AT_decl_line   : 130
    <fe5>   DW_AT_decl_column : 54
    <fe6>   DW_AT_type        : <0xecd>
    <fea>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><fed>: Abbrev Number: 0
 <1><fee>: Abbrev Number: 10 (DW_TAG_subprogram)
    <fef>   DW_AT_external    : 1
    <fef>   DW_AT_name        : (indirect string, offset: 0x87927): gpioClearPin
    <ff3>   DW_AT_decl_file   : 1
    <ff3>   DW_AT_decl_line   : 114
    <ff4>   DW_AT_decl_column : 6
    <ff4>   DW_AT_prototyped  : 1
    <ff4>   DW_AT_low_pc      : 0x80004f4
    <ff8>   DW_AT_high_pc     : 0x26
    <ffc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ffe>   DW_AT_call_all_tail_calls: 1
    <ffe>   DW_AT_sibling     : <0x101f>
 <2><1002>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1003>   DW_AT_name        : (indirect string, offset: 0x87a82): pstGpioPort
    <1007>   DW_AT_decl_file   : 1
    <1007>   DW_AT_decl_line   : 114
    <1008>   DW_AT_decl_column : 33
    <1009>   DW_AT_type        : <0xef4>
    <100d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1010>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1011>   DW_AT_name        : (indirect string, offset: 0x87a8e): unGpioPin
    <1015>   DW_AT_decl_file   : 1
    <1015>   DW_AT_decl_line   : 114
    <1016>   DW_AT_decl_column : 53
    <1017>   DW_AT_type        : <0xecd>
    <101b>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><101e>: Abbrev Number: 0
 <1><101f>: Abbrev Number: 10 (DW_TAG_subprogram)
    <1020>   DW_AT_external    : 1
    <1020>   DW_AT_name        : (indirect string, offset: 0x87ae0): gpioSetPin
    <1024>   DW_AT_decl_file   : 1
